In [1]:
import sqlite3

In [5]:
db=sqlite3.connect('my_databseeeueyyyiyy7eeet.db')

In [6]:
cursor=db.cursor()

In [7]:
cursor.execute('create table pratik(roll no PRIMARY KEY,Name text,age text,Course text,fees int,duration int)')

# Use of delete-

In [5]:
cursor.execute('delete from pratik')

# Use of drop

In [6]:
cursor.execute('drop table pratik')

In [7]:
cursor.execute('create table pratik(roll_no int PRIMARY KEY,name text,age text,course text,fees int,duration int)')

In [8]:
cursor.execute("insert into pratik(roll_no,name,age,course,fees,duration) VALUES(100,'pratik',28,'data science',50000,'1 year')")

In [9]:
print(cursor.rowcount,'records inserted')

1 records inserted

In [10]:
with open(r"C:\Users\prate\Downloads\database.csv",'r') as file:
    no_records=0
    for row in file:
        cursor.execute("insert into pratik values(?,?,?,?,?,?)",row.split(","))
        db.commit()
    no_records +=1    
print(no_records,'records inserted')

1 records inserted

In [11]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
('roll no', 'name', 'age', 'course', 'fees', 'duration\n')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# How to convert query result into data frame-

In [12]:
import pandas as pd

In [13]:
cursor.execute('select * from pratik')
df=pd.DataFrame(cursor.fetchall())
df

          0         1    2                    3       4           5
0       100    pratik   28         data science   50000      1 year
1   roll no      name  age               course    fees  duration\n
2       101   Pratik    22        data science    50000          16
3       102       ram   21  business analytics    60000          17
4       103    shyam    31                  MBA   70000          20
5       104      sita   31                  PHD   80000          18
6       105    ayush    34                   PG   90000          14
7       106    mayank   40          engineering  100000          19
8       107      raj    28                   IT  110000          14
9       108   ganesh    31        data science   120000          14
10      109   kartik    28  business analytics   130000          11
11      110   salman    33                  MBA  140000          13
12      111       srk   32                   IT  150000          16
13      112    ritik    27                   BE  160000          15
14      113    sheela   38                   ME  170000          13
15      114     reena   22                   IT  180000          18
16      115    mahima   20        data science   190000          15
17      116   ankita    33  business analytics   200000          18
18      117    jyoti    35                   ME  210000          18
19      118  aayushi    21                   BE  220000          19
20      119    ranka    39                   PG  230000          17
21      120    aditi    23          engineering  240000          15
22      121     jainu   30                   IT  250000          11
23      122    ritika   26        data science   260000          10
24      123   anushka   35                   ME  270000          10
25      124    sheelu   38                  MBA  280000          12
26      125     radha   24                  PHD  290000          10
27      126   surbhi    28                   PG  300000          19
28      127     neha    28          engineering  310000          15
29      128    gabbu    40                   IT  320000          10
30      129    tannu    30                   ME  330000          15
31      130     kannu   32                   BE  340000          19

In [14]:
cursor.description

(('roll_no', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('age', None, None, None, None, None, None),
 ('course', None, None, None, None, None, None),
 ('fees', None, None, None, None, None, None),
 ('duration', None, None, None, None, None, None))

In [15]:
df.columns=[x[0] for x in cursor.description]

In [16]:
df

    roll_no      name  age               course    fees    duration
0       100    pratik   28         data science   50000      1 year
1   roll no      name  age               course    fees  duration\n
2       101   Pratik    22        data science    50000          16
3       102       ram   21  business analytics    60000          17
4       103    shyam    31                  MBA   70000          20
5       104      sita   31                  PHD   80000          18
6       105    ayush    34                   PG   90000          14
7       106    mayank   40          engineering  100000          19
8       107      raj    28                   IT  110000          14
9       108   ganesh    31        data science   120000          14
10      109   kartik    28  business analytics   130000          11
11      110   salman    33                  MBA  140000          13
12      111       srk   32                   IT  150000          16
13      112    ritik    27                   BE  160000          15
14      113    sheela   38                   ME  170000          13
15      114     reena   22                   IT  180000          18
16      115    mahima   20        data science   190000          15
17      116   ankita    33  business analytics   200000          18
18      117    jyoti    35                   ME  210000          18
19      118  aayushi    21                   BE  220000          19
20      119    ranka    39                   PG  230000          17
21      120    aditi    23          engineering  240000          15
22      121     jainu   30                   IT  250000          11
23      122    ritika   26        data science   260000          10
24      123   anushka   35                   ME  270000          10
25      124    sheelu   38                  MBA  280000          12
26      125     radha   24                  PHD  290000          10
27      126   surbhi    28                   PG  300000          19
28      127     neha    28          engineering  310000          15
29      128    gabbu    40                   IT  320000          10
30      129    tannu    30                   ME  330000          15
31      130     kannu   32                   BE  340000          19

In [17]:
cursor.execute("delete from pratik where roll_no='roll no'")

In [18]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# Where clause-

In [19]:
result=cursor.execute('select * from pratik where roll_no=100')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')

# Between operator-

In [20]:
result=cursor.execute('select * from pratik where roll_no BETWEEN 101 AND 105')
for row in result:
    print(row)

(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)

# Not Between operator-

In [21]:
result=cursor.execute('select * from pratik where roll_no NOT BETWEEN 101 AND 105')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# IN operator-

In [22]:
result=cursor.execute('select * from pratik where roll_no IN(101,105,107,108)')
for row in result:
    print(row)

(101, 'Pratik ', '22', 'data science ', 50000, 16)
(105, 'ayush ', '34', 'PG', 90000, 14)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)

# Not IN Operator-

In [23]:
result=cursor.execute('select * from pratik where roll_no NOT IN(101,105,107,108)')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(106, 'mayank', '40', 'engineering', 100000, 19)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [24]:
result=cursor.execute("select * from pratik where course='MBA'")
for row in result:
    print(row)

(103, 'shyam ', '31', 'MBA', 70000, 20)
(110, 'salman ', '33', 'MBA', 140000, 13)
(124, 'sheelu', '38', 'MBA', 280000, 12)

In [25]:
result=cursor.execute("select * from pratik where fees=50000")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)

# Order BY-

In [26]:
result=cursor.execute("select * from pratik order by fees")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [27]:
result=cursor.execute("select * from pratik order by fees desc")
for row in result:
    print(row)

(130, 'kannu', '32', 'BE', 340000, 19)
(129, 'tannu ', '30', 'ME', 330000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(127, 'neha ', '28', 'engineering', 310000, 15)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(125, 'radha', '24', 'PHD', 290000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(123, 'anushka', '35', 'ME', 270000, 10)
(122, 'ritika', '26', 'data science ', 260000, 10)
(121, 'jainu', '30', 'IT', 250000, 11)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(119, 'ranka ', '39', 'PG', 230000, 17)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(114, 'reena', '22', 'IT', 180000, 18)
(113, 'sheela', '38', 'ME', 170000, 13)
(112, 'ritik ', '27', 'BE', 160000, 15)
(111, 'srk', '32', 'IT', 150000, 16)
(110, 'salman ', '33', 'MBA', 140000, 13)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(107, 'raj ', '28', 'IT', 110000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(105, 'ayush ', '34', 'PG', 90000, 14)
(104, 'sita', '31', 'PHD', 80000, 18)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)

# Selection with starting no-

In [28]:
result=cursor.execute("select * from pratik where name LIKE 'a%'")
for row in result:
    print(row)

(105, 'ayush ', '34', 'PG', 90000, 14)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(123, 'anushka', '35', 'ME', 270000, 10)

In [29]:
result=cursor.execute("select * from pratik where course LIKE 'd%'")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(115, 'mahima', '20', 'data science ', 190000, 15)
(122, 'ritika', '26', 'data science ', 260000, 10)

# Lower& Upper-

In [30]:
result=cursor.execute("select upper(course) from pratik")
for row in result:
    print(row)

('DATA SCIENCE',)
('DATA SCIENCE ',)
('BUSINESS ANALYTICS ',)
('MBA',)
('PHD',)
('PG',)
('ENGINEERING',)
('IT',)
('DATA SCIENCE ',)
('BUSINESS ANALYTICS ',)
('MBA',)
('IT',)
('BE',)
('ME',)
('IT',)
('DATA SCIENCE ',)
('BUSINESS ANALYTICS ',)
('ME',)
('BE',)
('PG',)
('ENGINEERING',)
('IT',)
('DATA SCIENCE ',)
('ME',)
('MBA',)
('PHD',)
('PG',)
('ENGINEERING',)
('IT',)
('ME',)
('BE',)

In [31]:
result=cursor.execute("select lower(course) from pratik")
for row in result:
    print(row)

('data science',)
('data science ',)
('business analytics ',)
('mba',)
('phd',)
('pg',)
('engineering',)
('it',)
('data science ',)
('business analytics ',)
('mba',)
('it',)
('be',)
('me',)
('it',)
('data science ',)
('business analytics ',)
('me',)
('be',)
('pg',)
('engineering',)
('it',)
('data science ',)
('me',)
('mba',)
('phd',)
('pg',)
('engineering',)
('it',)
('me',)
('be',)

# Where and operator-

In [32]:
result=cursor.execute("select * from pratik where course LIKE 'd%' and fees=50000")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)

# AND condition-

In [33]:
result=cursor.execute("select * from pratik where course='data science' and roll_no=100")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')

# Selecting particular columns-

In [34]:
result=cursor.execute("select roll_no,course from pratik where course='data science' and roll_no=100")
for row in result:
    print(row)

(100, 'data science')

In [35]:
result=cursor.execute("select fees,course from pratik where course LIKE 'd%' and fees=50000")
for row in result:
    print(row)

(50000, 'data science')
(50000, 'data science ')

# MIN-

In [36]:
result=cursor.execute("select min(fees) from pratik")
for row in result:
    print(row)

(50000,)

In [37]:
result=cursor.execute("select name,min(fees) from pratik")
for row in result:
    print(row)

('pratik', 50000)

In [38]:
result=cursor.execute("select * from pratik where fees=50000 ")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)

In [39]:
result=cursor.execute("delete from pratik where fees=='fees'")

# MAX-

In [40]:
result=cursor.execute("select name,max(fees) from pratik")
for row in result:
    print(row)

('kannu', 340000)

In [41]:
result=cursor.execute("select max(fees) from pratik")
for row in result:
    print(row)

(340000,)

In [42]:
result=cursor.execute("select * from pratik where fees=340000 ")
for row in result:
    print(row)

(130, 'kannu', '32', 'BE', 340000, 19)

# Subquery-

In [43]:
result=cursor.execute("select * from pratik")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [44]:
cursor.execute('create table prat(exam_id int primary key,roll_no int,father_name text,mother_name text,marks int,result text,foreign key (roll_no) references pratik(roll_no))')

In [45]:
cursor.execute("insert into prat values(201,101,'suresh sharma','sarita sharma',91,'pass')")

In [46]:
print(cursor.rowcount, 'records inserted')

1 records inserted

In [47]:
with open(r'C:\Users\prate\Downloads\table.csv') as file:
    no_records=0
    
    for row in file:
        cursor.execute("insert into prat values(?,?,?,?,?,?)",row.split(','))
        db.commit()
        
    no_records+=1
print(cursor.rowcount ,'records inserted')

1 records inserted

In [48]:
result=cursor.execute('select * from prat')
for row in result:
    print(row)

(201, 101, 'suresh sharma', 'sarita sharma', 91, 'pass')
('Exam id', 'Roll no', 'father name', 'mother name', 'marks', 'result\n')
(500, 102, 'Rakesh', 'sheetal', 90, 'pass\n')
(501, 103, 'shyam', 'pooja', 91, 'pass\n')
(502, 104, 'shiv ', 'mahima', 92, 'pass\n')
(503, 105, 'nehal', 'neha', 93, 'pass\n')
(504, 106, 'yashwant', 'surbhi', 94, 'pass\n')
(505, 107, 'raja', 'ranu', 34, 'fail\n')
(506, 108, 'aam singh ', 'nenu', 23, 'fail\n')
(507, 109, 'shetan singh ', 'renu', 33, 'fail\n')
(508, 110, 'giraj', 'sheetla', 32, 'fail\n')
(509, 111, 'shankar', 'rinku', 22, 'fail\n')
(510, 112, 'ram', 'reeta', 23, 'fail\n')
(511, 113, 'krishna', 'teena', 97, 'pass\n')
(512, 114, 'jagat', 'tona', 98, 'pass\n')
(513, 115, 'niwas ', 'mona', 99, 'pass\n')
(514, 116, 'shekhar', 'sona', 100, 'pass\n')

In [49]:
cursor.execute("delete from prat where exam_id='Exam id' ")

In [50]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [51]:
result=cursor.execute('select * from prat')
for row in result:
    print(row)

(201, 101, 'suresh sharma', 'sarita sharma', 91, 'pass')
(500, 102, 'Rakesh', 'sheetal', 90, 'pass\n')
(501, 103, 'shyam', 'pooja', 91, 'pass\n')
(502, 104, 'shiv ', 'mahima', 92, 'pass\n')
(503, 105, 'nehal', 'neha', 93, 'pass\n')
(504, 106, 'yashwant', 'surbhi', 94, 'pass\n')
(505, 107, 'raja', 'ranu', 34, 'fail\n')
(506, 108, 'aam singh ', 'nenu', 23, 'fail\n')
(507, 109, 'shetan singh ', 'renu', 33, 'fail\n')
(508, 110, 'giraj', 'sheetla', 32, 'fail\n')
(509, 111, 'shankar', 'rinku', 22, 'fail\n')
(510, 112, 'ram', 'reeta', 23, 'fail\n')
(511, 113, 'krishna', 'teena', 97, 'pass\n')
(512, 114, 'jagat', 'tona', 98, 'pass\n')
(513, 115, 'niwas ', 'mona', 99, 'pass\n')
(514, 116, 'shekhar', 'sona', 100, 'pass\n')

In [52]:
result=cursor.execute("select father_name,mother_name from prat where roll_no=(select roll_no from pratik where name='ram')")
for row in result:
    print(row)

('Rakesh', 'sheetal')

In [53]:
result=cursor.execute("select * from pratik where name between 'ram' and 'salman '")
for row in result:
    print(row)

(102, 'ram', '21', 'business analytics ', 60000, 17)
(110, 'salman ', '33', 'MBA', 140000, 13)
(112, 'ritik ', '27', 'BE', 160000, 15)
(114, 'reena', '22', 'IT', 180000, 18)
(119, 'ranka ', '39', 'PG', 230000, 17)
(122, 'ritika', '26', 'data science ', 260000, 10)

In [54]:
result=cursor.execute("select marks,result from prat where roll_no=(select roll_no from pratik where name='mayank')")
for row in result:
    print(row)

(94, 'pass\n')

# Joints in tables-

In [55]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [56]:
result=cursor.execute('select * from prat')
for row in result:
    print(row)

(201, 101, 'suresh sharma', 'sarita sharma', 91, 'pass')
(500, 102, 'Rakesh', 'sheetal', 90, 'pass\n')
(501, 103, 'shyam', 'pooja', 91, 'pass\n')
(502, 104, 'shiv ', 'mahima', 92, 'pass\n')
(503, 105, 'nehal', 'neha', 93, 'pass\n')
(504, 106, 'yashwant', 'surbhi', 94, 'pass\n')
(505, 107, 'raja', 'ranu', 34, 'fail\n')
(506, 108, 'aam singh ', 'nenu', 23, 'fail\n')
(507, 109, 'shetan singh ', 'renu', 33, 'fail\n')
(508, 110, 'giraj', 'sheetla', 32, 'fail\n')
(509, 111, 'shankar', 'rinku', 22, 'fail\n')
(510, 112, 'ram', 'reeta', 23, 'fail\n')
(511, 113, 'krishna', 'teena', 97, 'pass\n')
(512, 114, 'jagat', 'tona', 98, 'pass\n')
(513, 115, 'niwas ', 'mona', 99, 'pass\n')
(514, 116, 'shekhar', 'sona', 100, 'pass\n')

# Syntax for join-

SELECT table1.column1,table1.column2,table2.column1,....
FROM table1 
INNER JOIN table2
ON table1.matching_column = table2.matching_column;

# INNER JOIN-

In [57]:
result=cursor.execute('select prat.marks,pratik.name,pratik.course,pratik.fees from pratik INNER JOIN prat ON pratik.roll_no=prat.roll_no')
for row in result:
    print(row)

(91, 'Pratik ', 'data science ', 50000)
(90, 'ram', 'business analytics ', 60000)
(91, 'shyam ', 'MBA', 70000)
(92, 'sita', 'PHD', 80000)
(93, 'ayush ', 'PG', 90000)
(94, 'mayank', 'engineering', 100000)
(34, 'raj ', 'IT', 110000)
(23, 'ganesh ', 'data science ', 120000)
(33, 'kartik ', 'business analytics ', 130000)
(32, 'salman ', 'MBA', 140000)
(22, 'srk', 'IT', 150000)
(23, 'ritik ', 'BE', 160000)
(97, 'sheela', 'ME', 170000)
(98, 'reena', 'IT', 180000)
(99, 'mahima', 'data science ', 190000)
(100, 'ankita ', 'business analytics ', 200000)

# LEFT JOIN-

In [58]:
result=cursor.execute('select prat.marks,pratik.name,pratik.course,pratik.fees from pratik LEFT JOIN prat ON pratik.roll_no=prat.roll_no')
for row in result:
    print(row)

(None, 'pratik', 'data science', 50000)
(91, 'Pratik ', 'data science ', 50000)
(90, 'ram', 'business analytics ', 60000)
(91, 'shyam ', 'MBA', 70000)
(92, 'sita', 'PHD', 80000)
(93, 'ayush ', 'PG', 90000)
(94, 'mayank', 'engineering', 100000)
(34, 'raj ', 'IT', 110000)
(23, 'ganesh ', 'data science ', 120000)
(33, 'kartik ', 'business analytics ', 130000)
(32, 'salman ', 'MBA', 140000)
(22, 'srk', 'IT', 150000)
(23, 'ritik ', 'BE', 160000)
(97, 'sheela', 'ME', 170000)
(98, 'reena', 'IT', 180000)
(99, 'mahima', 'data science ', 190000)
(100, 'ankita ', 'business analytics ', 200000)
(None, 'jyoti ', 'ME', 210000)
(None, 'aayushi ', 'BE', 220000)
(None, 'ranka ', 'PG', 230000)
(None, 'aditi ', 'engineering', 240000)
(None, 'jainu', 'IT', 250000)
(None, 'ritika', 'data science ', 260000)
(None, 'anushka', 'ME', 270000)
(None, 'sheelu', 'MBA', 280000)
(None, 'radha', 'PHD', 290000)
(None, 'surbhi ', 'PG', 300000)
(None, 'neha ', 'engineering', 310000)
(None, 'gabbu ', 'IT', 320000)
(None, 'tannu ', 'ME', 330000)
(None, 'kannu', 'BE', 340000)

# RIGHT JOIN-

In [59]:
result=cursor.execute('select prat.marks,pratik.name,pratik.course,pratik.fees from pratik RIGHT JOIN prat ON pratik.roll_no=prat.roll_no')
for row in result:
    print(row)

(91, 'Pratik ', 'data science ', 50000)
(90, 'ram', 'business analytics ', 60000)
(91, 'shyam ', 'MBA', 70000)
(92, 'sita', 'PHD', 80000)
(93, 'ayush ', 'PG', 90000)
(94, 'mayank', 'engineering', 100000)
(34, 'raj ', 'IT', 110000)
(23, 'ganesh ', 'data science ', 120000)
(33, 'kartik ', 'business analytics ', 130000)
(32, 'salman ', 'MBA', 140000)
(22, 'srk', 'IT', 150000)
(23, 'ritik ', 'BE', 160000)
(97, 'sheela', 'ME', 170000)
(98, 'reena', 'IT', 180000)
(99, 'mahima', 'data science ', 190000)
(100, 'ankita ', 'business analytics ', 200000)

# Full join-

In [60]:
result=cursor.execute('select prat.marks,pratik.name,pratik.course,pratik.fees from pratik FULL JOIN prat ON pratik.roll_no=prat.roll_no')
for row in result:
    print(row)

(None, 'pratik', 'data science', 50000)
(91, 'Pratik ', 'data science ', 50000)
(90, 'ram', 'business analytics ', 60000)
(91, 'shyam ', 'MBA', 70000)
(92, 'sita', 'PHD', 80000)
(93, 'ayush ', 'PG', 90000)
(94, 'mayank', 'engineering', 100000)
(34, 'raj ', 'IT', 110000)
(23, 'ganesh ', 'data science ', 120000)
(33, 'kartik ', 'business analytics ', 130000)
(32, 'salman ', 'MBA', 140000)
(22, 'srk', 'IT', 150000)
(23, 'ritik ', 'BE', 160000)
(97, 'sheela', 'ME', 170000)
(98, 'reena', 'IT', 180000)
(99, 'mahima', 'data science ', 190000)
(100, 'ankita ', 'business analytics ', 200000)
(None, 'jyoti ', 'ME', 210000)
(None, 'aayushi ', 'BE', 220000)
(None, 'ranka ', 'PG', 230000)
(None, 'aditi ', 'engineering', 240000)
(None, 'jainu', 'IT', 250000)
(None, 'ritika', 'data science ', 260000)
(None, 'anushka', 'ME', 270000)
(None, 'sheelu', 'MBA', 280000)
(None, 'radha', 'PHD', 290000)
(None, 'surbhi ', 'PG', 300000)
(None, 'neha ', 'engineering', 310000)
(None, 'gabbu ', 'IT', 320000)
(None, 'tannu ', 'ME', 330000)
(None, 'kannu', 'BE', 340000)

# Like operator with different context-

In [61]:
result=cursor.execute("select name from pratik where name like '%j%'")
for row in result:
    print(row)

('raj ',)
('jyoti ',)
('jainu',)

In [62]:
result=cursor.execute("select name from pratik where name like '%j%' order by name")
for row in result:
    print(row)

('jainu',)
('jyoti ',)
('raj ',)

# count function-

In [67]:
result=cursor.execute("select COUNT(name) as count from pratik where name='Pratik ' ")
for row in result:
    print(row)

(1,)

In [68]:
result=cursor.execute("select COUNT(*) as 'count' from pratik where name='Pratik ' ")
for row in result:
    print(row)

(1,)

In [66]:
result=cursor.execute("select name,COUNT(*) as 'count' from pratik group by name")
for row in result:
    print(row)

('Pratik ', 1)
('aayushi ', 1)
('aditi ', 1)
('ankita ', 1)
('anushka', 1)
('ayush ', 1)
('gabbu ', 1)
('ganesh ', 1)
('jainu', 1)
('jyoti ', 1)
('kannu', 1)
('kartik ', 1)
('mahima', 1)
('mayank', 1)
('neha ', 1)
('pratik', 1)
('radha', 1)
('raj ', 1)
('ram', 1)
('ranka ', 1)
('reena', 1)
('ritik ', 1)
('ritika', 1)
('salman ', 1)
('sheela', 1)
('sheelu', 1)
('shyam ', 1)
('sita', 1)
('srk', 1)
('surbhi ', 1)
('tannu ', 1)

In [70]:
result=cursor.execute("select course,sum(fees) as fees, COUNT(course) as 'count' from pratik group by course order by fees")
for row in result:
    print(row)

('data science', 50000, 1)
('PHD', 370000, 2)
('business analytics ', 390000, 3)
('MBA', 490000, 3)
('PG', 620000, 3)
('data science ', 620000, 4)
('engineering', 650000, 3)
('BE', 720000, 3)
('ME', 980000, 4)
('IT', 1010000, 5)

In [63]:
result=cursor.execute("select course, COUNT(*) as 'count' from pratik group by course order by count")
for row in result:
    print(row)

('data science', 1)
('PHD', 2)
('BE', 3)
('MBA', 3)
('PG', 3)
('business analytics ', 3)
('engineering', 3)
('ME', 4)
('data science ', 4)
('IT', 5)

In [64]:
result=cursor.execute("select course,sum(fees) as sum from pratik group by course ")
for row in result:
    print(row)

('BE', 720000)
('IT', 1010000)
('MBA', 490000)
('ME', 980000)
('PG', 620000)
('PHD', 370000)
('business analytics ', 390000)
('data science', 50000)
('data science ', 620000)
('engineering', 650000)

In [72]:
result=cursor.execute("select course,sum(fees) as sum from pratik group by course having sum=720000")
for row in result:
    print(row)

('BE', 720000)

In [66]:
result=cursor.execute("select course,sum(fees) as sum from pratik group by course having sum>400000")
for row in result:
    print(row)

('BE', 720000)
('IT', 1010000)
('MBA', 490000)
('ME', 980000)
('PG', 620000)
('data science ', 620000)
('engineering', 650000)

In [319]:
result=cursor.execute("select * from pratik")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [323]:
result=cursor.execute('select course, count(*) as count from pratik group by course order by count')
for row in result:
    print(row)

('data science', 1)
('PHD', 2)
('BE', 3)
('MBA', 3)
('PG', 3)
('business analytics ', 3)
('engineering', 3)
('ME', 4)
('data science ', 4)
('IT', 5)

In [320]:
result=cursor.execute("select * from prat")
for row in result:
    print(row)

(201, 101, 'suresh sharma', 'sarita sharma', 91, 'pass')
(500, 102, 'Rakesh', 'sheetal', 90, 'pass\n')
(501, 103, 'shyam', 'pooja', 91, 'pass\n')
(502, 104, 'shiv ', 'mahima', 92, 'pass\n')
(503, 105, 'nehal', 'neha', 93, 'pass\n')
(504, 106, 'yashwant', 'surbhi', 94, 'pass\n')
(505, 107, 'raja', 'ranu', 34, 'fail\n')
(506, 108, 'aam singh ', 'nenu', 23, 'fail\n')
(507, 109, 'shetan singh ', 'renu', 33, 'fail\n')
(508, 110, 'giraj', 'sheetla', 32, 'fail\n')
(509, 111, 'shankar', 'rinku', 22, 'fail\n')
(510, 112, 'ram', 'reeta', 23, 'fail\n')
(511, 113, 'krishna', 'teena', 97, 'pass\n')
(512, 114, 'jagat', 'tona', 98, 'pass\n')
(513, 115, 'niwas ', 'mona', 99, 'pass\n')
(514, 116, 'shekhar', 'sona', 100, 'pass\n')

# When you want to show text string as usual-

In [9]:
result=cursor.execute("select 'prateek is a good boy'")
for row in result:
    print(row)

('prateek is a good boy',)

# To show addition or any mathematics of data-

In [10]:
result=cursor.execute("select 10+15")
for row in result:
    print(row)

(25,)

In [334]:
result=cursor.execute("select 10+15-8")
for row in result:
    print(row)

(17,)

# To get the unique values from the data base-

In [337]:
result=cursor.execute("select DISTINCT course from pratik")
for row in result:
    print(row)

('data science',)
('data science ',)
('business analytics ',)
('MBA',)
('PHD',)
('PG',)
('engineering',)
('IT',)
('BE',)
('ME',)

# You can use as many and operators in writing any query-

In [338]:
result=cursor.execute("select * from pratik")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# Selection with starting text- Like

In [358]:
result=cursor.execute("select * from pratik where course LIKE 'data%' ")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(115, 'mahima', '20', 'data science ', 190000, 15)
(122, 'ritika', '26', 'data science ', 260000, 10)

# NOT LIKE-

In [379]:
result=cursor.execute("select * from pratik where course NOT LIKE 'data%' ")
for row in result:
    print(row)

(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# Multiple and conditions-

In [350]:
result=cursor.execute("select * from pratik where fees>=18000 and course='data science ' and duration<= 10 ")
for row in result:
    print(row)

(122, 'ritika', '26', 'data science ', 260000, 10)

# Use of IN operator when selecting two conditions from same column-

In [354]:
result=cursor.execute("select * from pratik where fees>=18000 and course IN('data science ','PG')")
for row in result:
    print(row)

(101, 'Pratik ', '22', 'data science ', 50000, 16)
(105, 'ayush ', '34', 'PG', 90000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(115, 'mahima', '20', 'data science ', 190000, 15)
(119, 'ranka ', '39', 'PG', 230000, 17)
(122, 'ritika', '26', 'data science ', 260000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)

# Use of UNION-   


#formula- query1 union query2

In [101]:
result=cursor.execute("select * from prateek where fees>=180000 and course IN('data science ','PG') UNION select * from prateek where fees< 12000 and course IN('data science ','ME','BE')")
for row in result:
    print(row)

(115, 'mahima', '20', 'data science ', 190000, 15)
(119, 'ranka ', '39', 'PG', 230000, 17)
(122, 'ritika', '26', 'data science ', 260000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)

In [371]:
result=cursor.execute("select * from pratik")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [372]:
result=cursor.execute("select * from prat")
for row in result:
    print(row)

(201, 101, 'suresh sharma', 'sarita sharma', 91, 'pass')
(500, 102, 'Rakesh', 'sheetal', 90, 'pass\n')
(501, 103, 'shyam', 'pooja', 91, 'pass\n')
(502, 104, 'shiv ', 'mahima', 92, 'pass\n')
(503, 105, 'nehal', 'neha', 93, 'pass\n')
(504, 106, 'yashwant', 'surbhi', 94, 'pass\n')
(505, 107, 'raja', 'ranu', 34, 'fail\n')
(506, 108, 'aam singh ', 'nenu', 23, 'fail\n')
(507, 109, 'shetan singh ', 'renu', 33, 'fail\n')
(508, 110, 'giraj', 'sheetla', 32, 'fail\n')
(509, 111, 'shankar', 'rinku', 22, 'fail\n')
(510, 112, 'ram', 'reeta', 23, 'fail\n')
(511, 113, 'krishna', 'teena', 97, 'pass\n')
(512, 114, 'jagat', 'tona', 98, 'pass\n')
(513, 115, 'niwas ', 'mona', 99, 'pass\n')
(514, 116, 'shekhar', 'sona', 100, 'pass\n')

# Union we use when we want to extract data from two different tables-

In [83]:
result=cursor.execute("select * from pratik where age>28 and duration>10 UNION select * from prat where roll_no>110 and marks>95")
for row in result:
    print(row)

(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(113, 'sheela', '38', 'ME', 170000, 13)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(119, 'ranka ', '39', 'PG', 230000, 17)
(121, 'jainu', '30', 'IT', 250000, 11)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(511, 113, 'krishna', 'teena', 97, 'pass\n')
(512, 114, 'jagat', 'tona', 98, 'pass\n')
(513, 115, 'niwas ', 'mona', 99, 'pass\n')
(514, 116, 'shekhar', 'sona', 100, 'pass\n')

# Use of NOT IN- "query1 UNION query2"

In [378]:
result=cursor.execute("select * from pratik where age>28 and duration>10 UNION select * from prat where roll_no NOT IN(113,114) and marks>95")
for row in result:
    +
    print(row)

(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(113, 'sheela', '38', 'ME', 170000, 13)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(119, 'ranka ', '39', 'PG', 230000, 17)
(121, 'jainu', '30', 'IT', 250000, 11)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(513, 115, 'niwas ', 'mona', 99, 'pass\n')
(514, 116, 'shekhar', 'sona', 100, 'pass\n')

In [381]:
result=cursor.execute("select * from pratik")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# Use of case when- makes the first condition true than make second condition true-

# IT & ME will be at bottom-

In [77]:
result=cursor.execute("select * from pratik ORDER BY case when course IN('IT','ME') THEN 1 ELSE 0 END asc")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(112, 'ritik ', '27', 'BE', 160000, 15)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(122, 'ritika', '26', 'data science ', 260000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(111, 'srk', '32', 'IT', 150000, 16)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(121, 'jainu', '30', 'IT', 250000, 11)
(123, 'anushka', '35', 'ME', 270000, 10)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)

# IT & ME will be at top-

In [387]:
result=cursor.execute("select * from pratik ORDER BY case when course IN('IT','ME') THEN 0 ELSE 1 END asc")
for row in result:
    print(row)

(107, 'raj ', '28', 'IT', 110000, 14)
(111, 'srk', '32', 'IT', 150000, 16)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(121, 'jainu', '30', 'IT', 250000, 11)
(123, 'anushka', '35', 'ME', 270000, 10)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(112, 'ritik ', '27', 'BE', 160000, 15)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(122, 'ritika', '26', 'data science ', 260000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# Use of Where between and operator-

In [394]:
result=cursor.execute("select * from pratik WHERE duration BETWEEN 10 AND 15")
for row in result:
    print(row)

(105, 'ayush ', '34', 'PG', 90000, 14)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(115, 'mahima', '20', 'data science ', 190000, 15)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)

# Average & Sum, Count-

In [84]:
result=cursor.execute("select avg(age) from pratik where course= 'data science '")
for row in result:
    print(row)

(24.75,)

In [86]:
result=cursor.execute("select course,avg(age) as avg from pratik group by course")
for row in result:
    print(row)

('BE', 26.666666666666668)
('IT', 30.4)
('MBA', 34.0)
('ME', 34.5)
('PG', 33.666666666666664)
('PHD', 27.5)
('business analytics ', 27.333333333333332)
('data science', 28.0)
('data science ', 24.75)
('engineering', 30.333333333333332)

In [399]:
result=cursor.execute("select sum(age) from pratik where course= 'data science '")
for row in result:
    print(row)

(99,)

In [79]:
result=cursor.execute("select age from pratik where course= 'data science '")
for row in result:
    print(row)

('22',)
('31',)
('20',)
('26',)

In [88]:
result=cursor.execute("select count(age) from pratik where course= 'data science '")
for row in result:
    print(row)

(4,)

# Columns with their tag no-

In [416]:
result=cursor.execute('select name AS Name,course AS Course from pratik ')
for row in result:
    print(row)

('pratik', 'data science')
('Pratik ', 'data science ')
('ram', 'business analytics ')
('shyam ', 'MBA')
('sita', 'PHD')
('ayush ', 'PG')
('mayank', 'engineering')
('raj ', 'IT')
('ganesh ', 'data science ')
('kartik ', 'business analytics ')
('salman ', 'MBA')
('srk', 'IT')
('ritik ', 'BE')
('sheela', 'ME')
('reena', 'IT')
('mahima', 'data science ')
('ankita ', 'business analytics ')
('jyoti ', 'ME')
('aayushi ', 'BE')
('ranka ', 'PG')
('aditi ', 'engineering')
('jainu', 'IT')
('ritika', 'data science ')
('anushka', 'ME')
('sheelu', 'MBA')
('radha', 'PHD')
('surbhi ', 'PG')
('neha ', 'engineering')
('gabbu ', 'IT')
('tannu ', 'ME')
('kannu', 'BE')

In [103]:
#Description is used to locate course name-

In [410]:
result.description

(('Name', None, None, None, None, None, None),
 ('Course', None, None, None, None, None, None))

In [412]:
#To get list of columns-

In [414]:
for i in result.description:
    print(i[0])

Name
Course

# Query inside query when writing this type of code-

In [419]:
result=cursor.execute("select name,age from pratik where age=(select min(age) from pratik)")
for row in result:
    print(row)

('mahima', '20')

In [421]:
result=cursor.execute("select name,age from pratik where age=(select max(age) from pratik)")
for row in result:
    print(row)

('mayank', '40')
('gabbu ', '40')

# Where NOT-

In [430]:
result=cursor.execute("select * from pratik where not course='data science '")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [ ]:
result=cursor.execute("select * from pratik where ")
for row in result:
    print(row)

# When you want to select the row or any data where certain column data is null-

In [93]:
result=cursor.execute("select * from pratik where course is null ")
for row in result:
    print(row)

In [433]:
result=cursor.execute("select * from pratik where course is NOT null ")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [434]:
result=cursor.execute("delete from pratik where course='BE'")

In [435]:
result=cursor.execute("select * from pratik")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)

# UPDATE SET- "UPDATE TABLE_NAME SET"

In [439]:
result=cursor.execute("UPDATE pratik set course='BE' where fees=330000")

In [440]:
result=cursor.execute("select * from pratik")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'BE', 330000, 15)

# MIN-

In [442]:
result=cursor.execute("select MIN(fees) from pratik")
for row in result:
    print(row)

(50000,)

# %a- text ends with a-

In [444]:
result=cursor.execute("select name from pratik where name like '%a'")
for row in result:
    print(row)

('sita',)
('sheela',)
('reena',)
('mahima',)
('ritika',)
('anushka',)
('radha',)

# r%a- text starts with r and ends with a-

In [446]:
result=cursor.execute("select name from pratik where name like 'r%a'")
for row in result:
    print(row)

('reena',)
('ritika',)
('radha',)

# _a%- text whose second letter is a.

In [104]:
result=cursor.execute("select name from prateek where name like '_n%'")
for row in result:
    print(row)

('ankita ',)
('anushka',)

# To create new data base-

In [477]:
import sqlite3

In [478]:
db=sqlite3.connect('priyanka_database.db')

In [479]:
cursor=db.cursor()

# Advance SQL-

In [105]:
db=sqlite3.connect('wonder_databasssesss.db')

In [106]:
cursor=db.cursor()

In [107]:
cursor.execute('create table color(id int,name text,extra_fees ints)')

In [108]:
cursor.execute('create table customer(id int,first_name text,last_name text,favorite_color_id int,foreign key (id) references color(id))')

In [109]:
cursor.execute('create table category(id int,name text,parent_id int,foreign key (id) references color(id))')

In [110]:
cursor.execute('create table clothing(id int,name text,size int,price int,color_id TEXT,category_id int,foreign key (id) references color(id))')

In [111]:
cursor.execute('create table clothing_order(id int,customer_id int,clothing_id int,items text,order_date int)')

In [112]:
cursor.execute("insert into color values(101,'pratik',100),(102,'chinmay',300),(103,'ravi',100)")

In [113]:
cursor.execute("insert into customer values(101,'pratik','sharma',5),(102,'chinmay','pareek',3),(103,'ravi','shankar',10)")

In [114]:
cursor.execute("insert into clothing values(101,'SHIRT','M',100,'RED',1),(102,'PANT','L',200,'GREEN',2),(103,'TSHIRT','XL',400,'WHITE',3)")

#

Display the name of clothing items (name the column clothes), their color (name the column color), and the last name and first name of the customer(s) who bought this apparel in their favorite color. Sort rows according to color, in ascending order.

In [546]:
result=cursor.execute('select * from color')
for row in result:
    print(row)

(101, 'pratik', 100)
(102, 'chinmay', 300)
(103, 'ravi', 100)

In [547]:
result=cursor.execute('select * from customer')
for row in result:
    print(row)

(101, 'pratik', 'sharma', 5)
(102, 'chinmay', 'pareek', 3)
(103, 'ravi', 'shankar', 10)

In [548]:
result=cursor.execute('select * from clothing')
for row in result:
    print(row)

(101, 'SHIRT', 'M', 100, 'RED', 1)
(102, 'PANT', 'L', 200, 'GREEN', 2)
(103, 'TSHIRT', 'XL', 400, 'WHITE', 3)

In [553]:
result=cursor.execute('select clothing.name as cloth_name,clothing.color_id as type,color.name as name from clothing INNER JOIN color ON clothing.id = color.id')
for row in result:
    print(row)

('SHIRT', 'RED', 'pratik')
('PANT', 'GREEN', 'chinmay')
('TSHIRT', 'WHITE', 'ravi')

# What is a relational database?  


A relational database is a type of database that stores and allows access to data. These types of databases are referred to as "relational" because the data items within them have pre-determined relationships with one another. Data in a relational database is stored in tables. The tables are connected by unique IDs or "keys." When a user needs to access specific information, they can use a key to access all the tables of data that have been pre-determined to be related to that key.

# What is sqlite 

sqlite is a database engine (or storage engine) is the underlying software component that a database management system (DBMS) uses to create, read, update and delete (CRUD) data from a database.

# What are the usages of SQL?

SQL is responsible for maintaining the relational data and the data structures present in the database. Some of the common usages are given below:
    
To execute queries against a database     
To retrieve data from a database     
To inserts records in a database     
To updates records in a database      
To delete records from a database     
To create new databases    
To create new tables in a database      
To create views in a database      
To perform complex operations on the database.

# Does SQL support programming language features?

SQL refers to the Standard Query Language. Therefore, it is true that SQL is a language but does not actually support the programming language. It is a common language that doesn't have a loop, conditional statements, and logical operations. It cannot be used for anything other than data manipulation. It is a command language to perform database operations. The primary purpose of SQL is to retrieve, manipulate, update, delete, and perform complex operations like joins on the data present in the database.

# What are the subsets or the features of SQL?

Data definition language (DDL): It defines the data structure that consists of commands like CREATE, ALTER, DROP, etc. 

Data manipulation language (DML): It is used to manipulate existing data in the database. The commands in this category are SELECT, UPDATE, INSERT, etc.

Data control language (DCL): It controls access to the data stored in the database. The commands in this category include GRANT and REVOKE.

Transaction Control Language (TCL): It is used to deal with the transaction operations in the database. The commands in this category are COMMIT, ROLLBACK, SET TRANSACTION, SAVEPOINT, etc.

# What is the purpose of DDL Language?

DDL stands for Data definition language. It is the subset of a database that defines the data structure of the database when the database is created. For example, we can use the DDL commands to add, remove, or modify tables. It consists of the following commands: CREATE, ALTER and DELETE database objects such as schema, tables, indexes, view, sequence, etc

#  What is the purpose of DML Language?

Data manipulation language makes the user able to retrieve and manipulate data in a relational database. The DML commands can only perform read-only operations on data. We can perform the following operations using DDL language:

Insert data into the database through the INSERT command.
Retrieve data from the database through the SELECT command.
Update data in the database through the UPDATE command.
Delete data from the database through the DELETE command.

#  What is the purpose of DCL Language?

Data control language allows users to control access and permission management to the database. It is the subset of a database, which decides that what part of the database should be accessed by which user at what point of time. It includes two commands, GRANT and REVOKE.

GRANT: It enables system administrators to assign privileges and roles to the specific user accounts to perform specific tasks on the database.

REVOKE: It enables system administrators to revoke privileges and roles from the user accounts so that they cannot use the previously assigned permission on the database.

# DDL (Data Definition Language)
DDL or Data Definition Language actually consists of the SQL commands that can be used to define the database schema. It simply deals with descriptions of the database schema and is used to create and modify the structure of database objects in the database. DDL is a set of SQL commands used to create, modify, and delete database structures but not data. These commands are normally not used by a general user, who should be accessing the database via an application.

List of DDL commands: 

CREATE: This command is used to create the database or its objects (like table, index, function, views, store procedure, and triggers).
DROP: This command is used to delete objects from the database.
ALTER: This is used to alter the structure of the database.
TRUNCATE: This is used to remove all records from a table, including all spaces allocated for the records are removed.
COMMENT: This is used to add comments to the data dictionary.
RENAME: This is used to rename an object existing in the database.

# What are tables and fields in the database?

A table is a set of organized data in the form of rows and columns. It enables users to store and display records in the structure format. It is similar to worksheets in the spreadsheet application. Here rows refer to the tuples, representing the simple data item, and columns are the attribute of the data items present in a particular row. Columns can categorize as vertical, and Rows are horizontal.

Fields (specific cell)are the components to provide the structure for the table. It stores the same category of data in the same data type. A table contains a fixed number of columns but can have any number of rows known as the record. It is also called a column in the table of the database. It represents the attribute or characteristics of the entity in the record.

# What is a primary key?

A primary key is a field or the combination of fields that uniquely identify each record in the table. It is one of a special kind of unique key. If the column contains a primary key, it cannot be null or empty. A table can have duplicate columns, but it cannot have more than one primary key. It always stores unique values into a column. For example, the ROLL Number can be treated as the primary key for a student in the university or college.

# What is a foreign key?


The foreign key is used to link one or more tables together. It is also known as the referencing key. A foreign key is specified as a key that is related to the primary key of another table. It means a foreign key field in one table refers to the primary key field of the other table. It identifies each row of another table uniquely that maintains the referential integrity. The primary key-foreign key relationship is a very crucial relationship as it maintains the ACID properties of the database sometimes. It also prevents actions that would destroy links between the child and parent tables.

# What is a unique key? 

A unique key is a single or combination of fields that ensure all values stores in the column will be unique. It means a column cannot stores duplicate values. This key provides uniqueness for the column or set of columns. For example, the email addresses and roll numbers of student's tables should be unique. It can accept a null value but only one null value per column. It ensures the integrity of the column or group of columns to store different values into a table.

# What is the difference between a primary key and a unique key?

1. Primary key- 

The primary key act as a unique identifier for each record in the table.
We cannot store NULL values in the primary key column.
We cannot change or delete the primary key column values.

2. Unique key-

The unique key is also a unique identifier for records when the primary key is not present in the table.
We can store NULL value in the unique key column, but only one NULL is allowed.
We can modify the unique key column values.

# What is a Database-

A database is an organized collection of data that is structured into tables, rows, columns, and indexes. It helps the user to find the relevant information frequently. It is an electronic system that makes data access, data manipulation, data retrieval, data storing, and data management very easy. Almost every organization uses the database for storing the data due to its easily accessible and high operational ease. The database provides perfect access to data and lets us perform required tasks.

The following are the common features of a database:

Manages large amounts of data
Accurate
Easy to update
Security
Data integrity
Easy to research data

# What is meant by DBMS?

DBMS stands for Database Management System. It is a software program that primarily functions as an interface between the database and the end-user. It provides us the power such as managing the data, the database engine, and the database schema to facilitate the organization and manipulation of data using a simple query in almost no time. It is like a File Manager that manages data in a database rather than saving it in file systems. Without the database management system, it would be far more difficult for the user to access the database's data.

# What is RDBMS?

RDBMS stands for Relational Database Management System. It is a database management system based on a relational model. It facilitates you to manipulate the data stored in the tables by using relational operators. RDBMS stores the data into the collection of tables and links those tables using the relational operators easily whenever required. Examples of relational database management systems are Microsoft Access, MySQL, SQL Server, Oracle database, etc.

# What is Normalization in a Database?

Normalization is mainly used to add, delete or modify a field that can be made in a single table. The primary use of Normalization is to remove redundancy and remove the insert, delete and update distractions. Normalization breaks the table into small partitions and then links them using different relationships to avoid the chances of redundancy.

We perform normalization which is process of breaking of a table into multiple tables so that insertion,deletion,updation these 3 anamolies dont appear.

# What is Normalization?

Normalization is the process of organizing the data in the database.
Normalization is used to minimize the redundancy from a relation or set of relations. It is also used to eliminate undesirable characteristics like Insertion, Update, and Deletion Anomalies.
Normalization divides the larger table into smaller and links them using relationships.
The normal form is used to reduce redundancy from the database table.

# Why do we need Normalization?

The main reason for normalizing the relations is removing these anomalies. Failure to eliminate anomalies leads to data redundancy and can cause data integrity and other problems as the database grows. Normalization consists of a series of guidelines that helps to guide you in creating a good database structure.

# Data modification anomalies can be categorized into three types:

Insertion Anomaly: Insertion Anomaly refers to when one cannot insert a new tuple into a relationship due to lack of data.
Deletion Anomaly: The delete anomaly refers to the situation where the deletion of data results in the unintended loss of some other important data.
Updatation Anomaly: The update anomaly is when an update of a single data value requires multiple rows of data to be updated.

# Types of normalization-

1. First normal form- Rules as per the EF CODD is No column can consist of multivarited vales.
2. Second normal form- A relation will be in 2NF if it is in 1NF and all non-key attributes are fully functional dependent on the primary key. there should be no partial dependency.like the subset of any primary key must not define non prime attributes.
3. Third normal form- There must not be any transitive dependency.like roll no city & state where state is defined by city and city is defined by roll no which must not be there.
4. fourth normal form- There must not be multivalued dependency bw columns like pratik has 3 phone no & 3 email id in that condition divide the data into two columns one with name & phone no and other one is name & email id. 
5. BCNF- if roll no is defining the name than the left side key which is roll no always either be primary key or super key.
6. Fifth normal form- decomposition of table must be loss less which can be attend by making the common column the primary key.

short cut key-     
 PTM       
MDDDKD

# Difference between DELETE, DROP and TRUNCATE-

# 1. DELETE :   

Basically, it is a Data Manipulation Language Command (DML). It is used to delete one or more tuples of a table. With the help of the DELETE command, we can either delete all the rows in one go or can delete rows one by one. i.e., we can use it as per the requirement or the condition using the Where clause. It is comparatively slower than the TRUNCATE command. The TRUNCATE command does not remove the structure of the table.

SYNTAX  
If we want to delete all the rows of the table:
DELETE from;

SYNTAX  
If we want to delete the row of the table as per the condition then we use the WHERE clause,
DELETE FROM table_name WHERE condition;   

Note  Here we can use the ROLLBACK command to restore the tuple because it does not auto-commit.

# 2. DROP : 
It is a Data Definition Language Command (DDL). It is used to drop the whole table. With the help of the DROP command we can drop (delete) the whole structure in one go i.e. it removes the named elements of the schema. By using this command the existence of the whole table is finished or say lost. 

SYNTAX  
If we want to drop the table:
DROP table <table_name>;

Note  Here we cant restore the table by using the ROLLBACK command because it auto commits.

# DQL (Data Query Language)
DQL statements are used for performing queries on the data within schema objects. The purpose of the DQL Command is to get some schema relation based on the query passed to it. We can define DQL as follows it is a component of SQL statement that allows getting data from the database and imposing order upon it. It includes the SELECT statement. This command allows getting the data out of the database to perform operations with it. When a SELECT is fired against a table or tables the result is compiled into a further temporary table, which is displayed or perhaps received by the program i.e. a front-end.

List of DQL: 

SELECT: It is used to retrieve data from the database.

# 3. TRUNCATE : 

It is also a Data Definition Language Command (DDL). It is used to delete all the rows of a relation (table) in one go. With the help of the TRUNCATE command, we cant delete the single row as here WHERE clause is not used. By using this command the existence of all the rows of the table is lost. It is comparatively faster than the delete command as it deletes all the rows fastly. 

SYNTAX  
If we want to use truncate :
    
TRUNCATE table <table_name>;

Note  Here we cant restore the tuples of the table by using the ROLLBACK command.

Truncate command is fast in process because it does not store the data in log file or anywhere it just delete in one go so we can not roll back the data.

but in case delete it creates the log file so that we can rollback the data before applying commit.

# What is Normalization in a Database? 


Normalization is used to minimize redundancy and dependency by organizing fields and table of a database.

There are some rules of database normalization, which is commonly known as Normal From, and they are:

First normal form(1NF)
Second normal form(2NF)
Third normal form(3NF)
Boyce-Codd normal form(BCNF)
Using these steps, the redundancy, anomalies, inconsistency of the data in the database can be removed.

# What is the primary use of Normalization?

Normalization is mainly used to add, delete or modify a field that can be made in a single table. The primary use of 
Normalization is to remove redundancy and remove the insert, delete and update distractions. Normalization breaks the table 
into small partitions and then links them using different relationships to avoid the chances of redundancy.

# What is Denormalization in a Database?

Denormalization is a technique used by database administrators to optimize the efficiency of their database infrastructure. The denormalization concept is based on Normalization, which is defined as arranging a database into tables correctly for a particular purpose. This method allows us to add redundant data into a normalized database to alleviate issues with database queries that merge data from several tables into a single table. It adds redundant terms into the tables to avoid complex joins and many other complex operations.

Denormalization doesn't mean that normalization will not be done. It is an optimization strategy that takes place after the normalization process.

# What is redundancy in database-

Redundancy in a database occurs when the same data is stored in multiple places. Redundancy can cause various problems such as data inconsistencies, higher storage requirements, and slower data retrieval.

Data redundancy occurs when the same piece of data is stored in two or more separate places and is a common occurrence in many businesses. As more companies are moving  away from siloed data to using a central repository to store information, they are finding that their database is filled with inconsistent duplicates of the same entry. Although it can be challenging to reconcile  or even benefit from  duplicate data entries, understanding how to reduce and track data redundancy efficiently can help mitigate long-term inconsistency issues for your business.

Top 4 advantages of data redundancy 
Although data redundancy sounds like a negative event, there are many organizations that can benefit from this process when its intentionally built into daily operations. 

1. Alternative data backup method
Backing up data involves creating compressed and encrypted versions of data and storing it in a computer system or the cloud. Data redundancy offers an extra layer of protection and reinforces the backup by replicating data to an additional system. Its often an advantage when companies incorporate data redundancy into their disaster recovery plans. 

2. Better data security 
Data security relates to protecting data, in a database or a file storage system, from unwanted activities such as cyberattacks or data breaches. Having the same data stored in two or more separate places can protect an organization in the event of a cyberattack or breach  an event which can result in lost time and money, as well as a damaged reputation. 

3. Faster data access and updates
When data is redundant, employees enjoy fast access and quick updates because the necessary information is available on multiple systems. This is particularly important for customer service-based organizations whose customers expect promptness and efficiency. 

4. Improved data reliability 
Data that is reliable is complete and accurate. Organizations can use data redundancy to double check data and confirm its correct and completed in full  a necessity when interacting with customers, vendors, internal staff, and others

# Problems Caused Due to Redundancy-

1. Data Inconsistency: Redundancy can lead to data inconsistencies, where the same data is stored in multiple locations, and changes to one copy of the data are not reflected in the other copies. This can result in incorrect data being used in decision-making processes and can lead to errors and inconsistencies in the data.

2. Storage Requirements: Redundancy increases the storage requirements of a database. If the same data is stored in multiple places, more storage space is required to store the data. This can lead to higher costs and slower data retrieval.
Update Anomalies: Redundancy can lead to update anomalies, where changes made to one copy of the data are not reflected in the other copies. This can result in incorrect data being used in decision-making processes and can lead to errors and inconsistencies in the data.

3. Performance Issues: Redundancy can also lead to performance issues, as the database must spend more time updating multiple copies of the same data. This can lead to slower data retrieval and slower overall performance of the database.
Security Issues: Redundancy can also create security issues, as multiple copies of the same data can be accessed and manipulated by unauthorized users. This can lead to data breaches and compromise the confidentiality, integrity, and availability of the data.

4. Maintenance Complexity: Redundancy can increase the complexity of database maintenance, as multiple copies of the same data must be updated and synchronized. This can make it more difficult to troubleshoot and resolve issues and can require more time and resources to maintain the database.

5. Data Duplication: Redundancy can lead to data duplication, where the same data is stored in multiple locations, resulting in wasted storage space and increased maintenance complexity. This can also lead to confusion and errors, as different copies of the data may have different values or be out of sync.

# Auto commit-

As the name suggests, the auto-commit statement is used to avoid the explicit mention of the commit command after each SQL statement. The commit statement itself gets executed by the server after each SQL statement. Each SQL statement is treated as a different transaction. An SQL statement executed in autocommit mode cannot be rolled back.

# Difference bw Commit and Roll back-

# 1. COMMIT-

COMMIT in SQL is a transaction control language that is used to permanently save the changes done in the transaction in tables/databases. The database cannot regain its previous state after its execution of commit. 


# Rollback-

ROLLBACK in SQL is a transactional control language that is used to undo the transactions that have not been saved in the database. The command is only been used to undo changes since the last COMMIT.

# Table columns are also referred to as fields

# Case statement-

In [ ]:
SELECT OrderID, Quantity,
CASE WHEN Quantity > 30 THEN 'The quantity is greater than 30'
WHEN Quantity = 30 THEN 'The quantity is 30'
ELSE 'The quantity is under 30'
END AS QuantityText
FROM OrderDetails;

In [ ]:
OrderID	Quantity	QuantityText
10248	12	The quantity is under 30
10248	10	The quantity is under 30
10248	5	The quantity is under 30
10249	9	The quantity is under 30
10249	40	The quantity is greater than 30
10250	10	The quantity is under 30
10250	35	The quantity is greater than 30
10250	15	The quantity is under 30
10251	6	The quantity is under 30
10251	15	The quantity is under 30
10251	20	The quantity is under 30
10252	40	The quantity is greater than 30
10252	25	The quantity is under 30
10252	40	The quantity is greater than 30
10253	20	The quantity is under 30
10253	42	The quantity is greater than 30
10253	40	The quantity is greater than 30
10254	15	The quantity is under 30
10254	21	The quantity is under 30
10254	21	The quantity is under 30
10255	20	The quantity is under 30
10255	35	The quantity is greater than 30
10255	25	The quantity is under 30
10255	30	The quantity is 30
10256	15	The quantity is under 30
10256	12	The quantity is under 30
10257	25	The quantity is under 30

# CASE Syntax-
CASE    
    WHEN condition1 THEN result1     
    WHEN condition2 THEN result2    
    WHEN conditionN THEN resultN    
    ELSE result
END;

# SQL CREATE INDEX Statement-

The CREATE INDEX statement is used to create indexes in tables.

Indexes are used to retrieve data from the database more quickly than otherwise. The users cannot see the indexes, they are just used to speed up searches/queries.

Note: Updating a table with indexes takes more time than updating a table without (because the indexes also need an update). So, only create indexes on columns that will be frequently searched against.

In [579]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
('roll no', 'name', 'age', 'course', 'fees', 'duration\n')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [582]:
cursor.execute('create index xxxx on pratik(roll_no)')

# DROP INDEX Statement-

In [589]:
cursor.execute("drop INDEX xxxx")

# What are the different types of SQL operators?

Operators are the special keywords or special characters reserved for performing particular operations. They are also used in SQL queries. We can primarily use these operators within the WHERE clause of SQL commands. It's a part of the command to filters data based on the specified condition. The SQL operators can be categorized into the following types:


# Arithmetic operators:

These operators are used to perform mathematical operations on numerical data. The categories of this operators are addition (+), subtraction (-), multiplication (*), division (/), remainder/modulus (%), etc.
Logical operators: These operators evaluate the expressions and return their results in True or False. This operator includes ALL, AND, ANY, ISNULL, EXISTS, BETWEEN, IN, LIKE, NOT, OR, UNIQUE.

# Comparison operators: 
These operators are used to perform comparisons of two values and check whether they are the same or not. It includes equal to (=), not equal to (!= or <>), less than (<), greater than (>), less than or equal to (<=), greater than or equal to (>=), not less than (!<), not greater than (!>), etc.

# Bitwise operators:
It is used to do bit manipulations between two expressions of integer type. It first performs conversion of integers into binary bits and then applied operators such as AND (& symbol), OR (|, ^), NOT (~), etc.

# Compound operators:  
These operators perform operations on a variable before setting the variable's result to the operation's result. It includes Add equals (+=), subtract equals (-=), multiply equals (*=), divide equals (/=), modulo equals (%=), etc.

# String operators: 

These operators are primarily used to perform concatenation and pattern matching of strings. It includes + (String concatenation), += (String concatenation assignment), % (Wildcard), [] (Character(s) matches), [^] (Character(s) not to match), _ (Wildcard match one character), etc.

# View creation in sql-

In [14]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
('roll no', 'name', 'age', 'course', 'fees', 'duration\n')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [26]:
cursor.execute("delete from pratik where roll_no='roll no'")

In [22]:
cursor.execute("insert into pratik values(131,'raamma',44,'ME',35999,21)")

In [24]:
result=cursor.execute('CREATE VIEW shivaa AS  SELECT roll_no FROM pratik  WHERE roll_no>120')

In [27]:
result=cursor.execute('select * from shivaa')
for row in result:
    print(row)

(121,)
(122,)
(123,)
(124,)
(125,)
(126,)
(127,)
(128,)
(129,)
(130,)
(131,)

# What is a view in SQL-

In SQL, a view is a virtual table based on the result-set of an SQL statement.

A view contains rows and columns, just like a real table. The fields in a view are fields from one or more real tables in the database.

we can see above code result that a view is a subset of data we extracted through our query. it generally get updated as we update the main table.

# What is an Index in SQL?

An index is a disc structure associated with a table or view that speeds up row retrieval. It reduces the cost of the query because the query's high cost will lead to a fall in its performance. It is used to increase the performance and allow faster retrieval of records from the table. Indexing reduces the number of data pages we need to visit to find a particular data page. It also has a unique value meaning that the index cannot be duplicated. An index creates an entry for each value which makes it faster to retrieve data.

For example: Suppose we have a book which carries the details of the countries. If you want to find out information about India, why will you go through every page of that book? You could directly go to the index. Then from the index, you can go to that particular page where all the information about India is given.

SQL indexes are nothing more than a technique of minimizing the query's cost. The higher the query's cost, the worse the query's performance.

In [58]:
cursor.execute('Create unique index indexx on pratik(roll_no)')

In [67]:
result=cursor.execute('select * from shivaa')
for row in result:
    print(row)

(121,)
(122,)
(123,)
(124,)
(125,)
(126,)
(127,)
(128,)
(129,)
(130,)
(131,)

In [59]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(131, 'raamma', '44', 'ME', 35999, 21)

# To check index-

In [62]:
result=cursor.execute("PRAGMA index_list('pratik')")
for row in result:
    print(row)

(0, 'indexx', 1, 'c', 0)
(1, 'sheena', 1, 'c', 0)
(2, 'idx_contacts_email', 1, 'c', 0)
(3, 'sqlite_autoindex_pratik_1', 1, 'pk', 0)

# To drop index-

In [63]:
cursor.execute("drop index sheena")

In [64]:
cursor.execute("drop index idx_contacts_email ")

In [66]:
result=cursor.execute("PRAGMA index_list('pratik')")
for row in result:
    print(row)

(0, 'indexx', 1, 'c', 0)
(1, 'sqlite_autoindex_pratik_1', 1, 'pk', 0)

# What is the unique index?
UNIQUE INDEX is used to enforce the uniqueness of values in single or multiple columns. We can create more than one unique index in a single table. For creating a unique index, the user has to check the data in the column because the unique indexes are used when any column of the table has unique values. This indexing does not allow the field to have duplicate values if the column is unique indexed. A unique index can be applied automatically when a primary key is defined.

# Difference bw where and having-

In SQL, WHERE and HAVING clauses are used to filter records from a table based on a specified condition. The main difference between them is that the WHERE clause is used to filter records before any groupings are made, while the HAVING clause is used to filter values from a group

# Advantages of views-

SQL views are very powerful when used properly. They allow us to store our SQL queries into virtualized containers (aka virtual tables) in our database. They also contain rows and columns just like a traditional table. The main difference is that views dont store any data, while tables do. Views are only able to store the underlying SQL statement to retrieve a result set. There isnt an option to insert or update data in views since they only act as a reference to data in physical tables.

1. Reusability-
Views allow us to easily access our SQL queries without having to re-write our SELECT statements repeatedly. For example, we would create a view if we had multiple tables that we commonly join to. These views may have conditional logic or aggregations we dont want to constantly rewrite. Just be careful with this kind of approach since it can often result in performance degradation if not used properly. Many database users begin to treat views as if they were tables. That can be a problem if the user doesnt understand the underlying query within the view.


2. Storing the complexities-
We can use SQL queries to build in complex business logic with certain formulas or combination of data joins and filters. SQL views are a great away to store these complexities and have accessibility and reusability.


3. Security-
Views are another way to limit visibility into a database. We may not want to provide certain users access to actual tables and rather give them access to views that would have a slice of the data rather than the full set. As an example, we may have teachers at a school that need access to their student data. We only want to give them access to view their own students. Views can be an effective method at providing the visibility they need.

# Case when Function practicle-

In [68]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(131, 'raamma', '44', 'ME', 35999, 21)

In [76]:
result=cursor.execute("select roll_no,name, case when roll_no>125 then 'good' when roll_no<=125 then 'bad' else 'easy' end as column_name from pratik")
for row in result:
    print(row)

(100, 'pratik', 'bad')
(101, 'Pratik ', 'bad')
(102, 'ram', 'bad')
(103, 'shyam ', 'bad')
(104, 'sita', 'bad')
(105, 'ayush ', 'bad')
(106, 'mayank', 'bad')
(107, 'raj ', 'bad')
(108, 'ganesh ', 'bad')
(109, 'kartik ', 'bad')
(110, 'salman ', 'bad')
(111, 'srk', 'bad')
(112, 'ritik ', 'bad')
(113, 'sheela', 'bad')
(114, 'reena', 'bad')
(115, 'mahima', 'bad')
(116, 'ankita ', 'bad')
(117, 'jyoti ', 'bad')
(118, 'aayushi ', 'bad')
(119, 'ranka ', 'bad')
(120, 'aditi ', 'bad')
(121, 'jainu', 'bad')
(122, 'ritika', 'bad')
(123, 'anushka', 'bad')
(124, 'sheelu', 'bad')
(125, 'radha', 'bad')
(126, 'surbhi ', 'good')
(127, 'neha ', 'good')
(128, 'gabbu ', 'good')
(129, 'tannu ', 'good')
(130, 'kannu', 'good')
(131, 'raamma', 'good')

# Limit function we do use for getting the highest or lowest or top or bottom no of elements-

In [85]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(131, 'raamma', '44', 'ME', 35999, 21)

In [92]:
result=cursor.execute("select distinct course from pratik where course like 'p%' order by course desc ")
for row in result:
    print(row)

('PHD',)
('PG',)

In [106]:
result=cursor.execute("select roll_no,fees as fees from pratik order by fees desc limit 2 ")
for row in result:
    print(row)

(130, 340000)
(129, 330000)

# use of offset-

# How to get 2nd lowest value-

In [109]:
result=cursor.execute("select roll_no,fees as fees from pratik order by fees asc limit 1 offset 1 ")
for row in result:
    print(row)

(100, 50000)

# How to get 2nd heighest value-

In [64]:
result=cursor.execute("select roll_no,fees as fees from pratik order by fees desc limit 1 offset 1")
for row in result:
    print(row)

(129, 330000)

# Char & Varchar-

# 1. CHAR Datatype: 
It is a datatype in SQL which is used to store character string of fixed length specified. If the length of the string is less than set or fixed-length then it is padded with extra blank spaces so that its length became equal to the set length when PAD_CHAR_TO_FULL_LENGTH SQL mode is enabled. The storage size of the CHAR datatype is n bytes(set length). We should use this datatype when we expect the data values in a column are of the same length. 

Example: 
Consider the Query:  

CREATE TABLE Student(Name VARCHAR(30), Gender CHAR(6));
INSERT into Student VALUES('Herry', 'Male');
INSERT into Student VALUES('Mahi', 'Female');
SELECT LENGTH(Gender) FROM Student;
OUTPUT:  

LENGTH(Gender)   
6    
6



# 2. VARCHAR Datatype: 

It is a datatype in SQL which is used to store character string of variable length but a maximum of the set length specified. If the length of the string is less than set or fixed-length then it will store as it is without padded with extra blank spaces. The storage size of the VARCHAR datatype is equal to the actual length of the entered string in bytes. We should use this datatype when we expect the data values in a column are of variable length. 

Consider the Query:  

CREATE TABLE Student(Name VARCHAR(20), Gender CHAR(6));
INSERT into Student VALUES('Herry', 'Male');
INSERT into Student VALUES('Mahi', 'Female');
SELECT LENGTH(Name) FROM Student;
OUTPUT:  

LENGTH(Name)     
5    
4

# Aggregate functions: 
These functions are used to do operations from the values of the column and a single value is returned. 
AVG()      
COUNT()      
FIRST()      
LAST()      
MAX()     
MIN()      
SUM()     


# Scalar functions: 
These functions are based on user input, these too returns single value.      
UCASE()      
LCASE()      
MID()      
LEN()      
ROUND()      
NOW()      
FORMAT()

# Count Function- will give you how many rows are there-

In [110]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(131, 'raamma', '44', 'ME', 35999, 21)

In [111]:
result=cursor.execute('select count(roll_no) from pratik')
for row in result:
    print(row)

(32,)

In [113]:
result=cursor.execute('select count(course) from pratik')
for row in result:
    print(row)

(32,)

In [107]:
result=cursor.execute('select count(distinct course) from prateek')
for row in result:
    print(row)

(11,)

In [118]:
result=cursor.execute('select count (*) from pratik')
for row in result:
    print(row)

(32,)

In [120]:
result=cursor.execute('select course, count (*) as count from pratik group by course')
for row in result:
    print(row)

('BE', 3)
('IT', 5)
('MBA', 3)
('ME', 5)
('PG', 3)
('PHD', 2)
('business analytics ', 3)
('data science', 1)
('data science ', 4)
('engineering', 3)

# avg-

In [116]:
result=cursor.execute('select avg(fees) from pratik')
for row in result:
    print(row)

(185499.96875,)

# sum-

In [128]:
result=cursor.execute('select sum(fees) from pratik')
for row in result:
    print(row)

(5935999,)

# Upper-

In [129]:
result=cursor.execute('select upper(course) from pratik')
for row in result:
    print(row)

('DATA SCIENCE',)
('DATA SCIENCE ',)
('BUSINESS ANALYTICS ',)
('MBA',)
('PHD',)
('PG',)
('ENGINEERING',)
('IT',)
('DATA SCIENCE ',)
('BUSINESS ANALYTICS ',)
('MBA',)
('IT',)
('BE',)
('ME',)
('IT',)
('DATA SCIENCE ',)
('BUSINESS ANALYTICS ',)
('ME',)
('BE',)
('PG',)
('ENGINEERING',)
('IT',)
('DATA SCIENCE ',)
('ME',)
('MBA',)
('PHD',)
('PG',)
('ENGINEERING',)
('IT',)
('ME',)
('BE',)
('ME',)

# length-

In [134]:
result=cursor.execute('select length(course) from pratik')
for row in result:
    print(row)

(12,)
(13,)
(19,)
(3,)
(3,)
(2,)
(11,)
(2,)
(13,)
(19,)
(3,)
(2,)
(2,)
(2,)
(2,)
(13,)
(19,)
(2,)
(2,)
(2,)
(11,)
(2,)
(13,)
(2,)
(3,)
(3,)
(2,)
(11,)
(2,)
(2,)
(2,)
(2,)

# substr-returns specified no of strings length

In [140]:
result=cursor.execute('select substr(course,1,3) from pratik')
for row in result:
    print(row)

('dat',)
('dat',)
('bus',)
('MBA',)
('PHD',)
('PG',)
('eng',)
('IT',)
('dat',)
('bus',)
('MBA',)
('IT',)
('BE',)
('ME',)
('IT',)
('dat',)
('bus',)
('ME',)
('BE',)
('PG',)
('eng',)
('IT',)
('dat',)
('ME',)
('MBA',)
('PHD',)
('PG',)
('eng',)
('IT',)
('ME',)
('BE',)
('ME',)

# Round- round off with decimals

In [148]:
result=cursor.execute('select round(avg(fees),0) from pratik')
for row in result:
    print(row)

(185500.0,)

# DATETIME() function-

In [161]:
result=cursor.execute('select  name, datetime() as now from pratik')
for row in result:
    print(row)

('pratik', '2023-10-08 11:46:23')
('Pratik ', '2023-10-08 11:46:23')
('ram', '2023-10-08 11:46:23')
('shyam ', '2023-10-08 11:46:23')
('sita', '2023-10-08 11:46:23')
('ayush ', '2023-10-08 11:46:23')
('mayank', '2023-10-08 11:46:23')
('raj ', '2023-10-08 11:46:23')
('ganesh ', '2023-10-08 11:46:23')
('kartik ', '2023-10-08 11:46:23')
('salman ', '2023-10-08 11:46:23')
('srk', '2023-10-08 11:46:23')
('ritik ', '2023-10-08 11:46:23')
('sheela', '2023-10-08 11:46:23')
('reena', '2023-10-08 11:46:23')
('mahima', '2023-10-08 11:46:23')
('ankita ', '2023-10-08 11:46:23')
('jyoti ', '2023-10-08 11:46:23')
('aayushi ', '2023-10-08 11:46:23')
('ranka ', '2023-10-08 11:46:23')
('aditi ', '2023-10-08 11:46:23')
('jainu', '2023-10-08 11:46:23')
('ritika', '2023-10-08 11:46:23')
('anushka', '2023-10-08 11:46:23')
('sheelu', '2023-10-08 11:46:23')
('radha', '2023-10-08 11:46:23')
('surbhi ', '2023-10-08 11:46:23')
('neha ', '2023-10-08 11:46:23')
('gabbu ', '2023-10-08 11:46:23')
('tannu ', '2023-10-08 11:46:23')
('kannu', '2023-10-08 11:46:23')
('raamma', '2023-10-08 11:46:23')

# What is SQL? 
SQL stands for Structured Query Language. It is a language used to interact with the database, i.e to create a database, to create a table in the database, to retrieve data or update a table in the database, etc. SQL is an ANSI(American National Standards Institute) standard. Using SQL, we can do many things. For example  we can execute queries, we can insert records into a table, can update records, can create a database, can create a table, can delete a table, etc.

# Does SQL support programming language features? 
It is true that SQL is a language, but it does not support programming as it is not a programming language, it is a command language. We do not have conditional statements in SQL like for loops or if..else, we only have commands which we can use to query, update, delete, etc. data in the database. SQL allows us to manipulate data in a database.

# TRIM function- Removes spaces

In [164]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(131, 'raamma', '44', 'ME', 35999, 21)

In [167]:
result=cursor.execute('select trim(name) as name from pratik')
for row in result:
    print(row)

('pratik',)
('Pratik',)
('ram',)
('shyam',)
('sita',)
('ayush',)
('mayank',)
('raj',)
('ganesh',)
('kartik',)
('salman',)
('srk',)
('ritik',)
('sheela',)
('reena',)
('mahima',)
('ankita',)
('jyoti',)
('aayushi',)
('ranka',)
('aditi',)
('jainu',)
('ritika',)
('anushka',)
('sheelu',)
('radha',)
('surbhi',)
('neha',)
('gabbu',)
('tannu',)
('kannu',)
('raamma',)

# Replace function-

In [178]:
result=cursor.execute("UPDATE pratik set course=replace(course,'data','DATA')")

In [180]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'DATA science', 50000, '1 year')
(101, 'Pratik ', '22', 'DATA science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'DATA science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'DATA science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'DATA science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)
(131, 'raamma', '44', 'ME', 35999, 21)

# Concatenate function-

In [6]:
result=cursor.execute("select name || ' ' || course from pratik")
for row in result:
    print(row)

('pratik data science',)
('name course',)
('Pratik  data science ',)
('ram business analytics ',)
('shyam  MBA',)
('sita PHD',)
('ayush  PG',)
('mayank engineering',)
('raj  IT',)
('ganesh  data science ',)
('kartik  business analytics ',)
('salman  MBA',)
('srk IT',)
('ritik  BE',)
('sheela ME',)
('reena IT',)
('mahima data science ',)
('ankita  business analytics ',)
('jyoti  ME',)
('aayushi  BE',)
('ranka  PG',)
('aditi  engineering',)
('jainu IT',)
('ritika data science ',)
('anushka ME',)
('sheelu MBA',)
('radha PHD',)
('surbhi  PG',)
('neha  engineering',)
('gabbu  IT',)
('tannu  ME',)
('kannu BE',)

# Row count function-

In [26]:
result=cursor.execute("SELECT count(roll_no) from pratik")
for row in result:
    print(row)

(32,)

# How to add column to a table-

In [27]:
cursor.execute('alter table pratik add column history text')

In [28]:
result=cursor.execute("SELECT * from pratik")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year', None)
('roll no', 'name', 'age', 'course', 'fees', 'duration\n', None)
(101, 'Pratik ', '22', 'data science ', 50000, 16, None)
(102, 'ram', '21', 'business analytics ', 60000, 17, None)
(103, 'shyam ', '31', 'MBA', 70000, 20, None)
(104, 'sita', '31', 'PHD', 80000, 18, None)
(105, 'ayush ', '34', 'PG', 90000, 14, None)
(106, 'mayank', '40', 'engineering', 100000, 19, None)
(107, 'raj ', '28', 'IT', 110000, 14, None)
(108, 'ganesh ', '31', 'data science ', 120000, 14, None)
(109, 'kartik ', '28', 'business analytics ', 130000, 11, None)
(110, 'salman ', '33', 'MBA', 140000, 13, None)
(111, 'srk', '32', 'IT', 150000, 16, None)
(112, 'ritik ', '27', 'BE', 160000, 15, None)
(113, 'sheela', '38', 'ME', 170000, 13, None)
(114, 'reena', '22', 'IT', 180000, 18, None)
(115, 'mahima', '20', 'data science ', 190000, 15, None)
(116, 'ankita ', '33', 'business analytics ', 200000, 18, None)
(117, 'jyoti ', '35', 'ME', 210000, 18, None)
(118, 'aayushi ', '21', 'BE', 220000, 19, None)
(119, 'ranka ', '39', 'PG', 230000, 17, None)
(120, 'aditi ', '23', 'engineering', 240000, 15, None)
(121, 'jainu', '30', 'IT', 250000, 11, None)
(122, 'ritika', '26', 'data science ', 260000, 10, None)
(123, 'anushka', '35', 'ME', 270000, 10, None)
(124, 'sheelu', '38', 'MBA', 280000, 12, None)
(125, 'radha', '24', 'PHD', 290000, 10, None)
(126, 'surbhi ', '28', 'PG', 300000, 19, None)
(127, 'neha ', '28', 'engineering', 310000, 15, None)
(128, 'gabbu ', '40', 'IT', 320000, 10, None)
(129, 'tannu ', '30', 'ME', 330000, 15, None)
(130, 'kannu', '32', 'BE', 340000, 19, None)

# Update the name of the table-

In [52]:
cursor.execute('alter table pratik rename to prateek')

In [53]:
result=cursor.execute("SELECT * from prateek")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
('roll no', 'name', 'age', 'course', 'fees', 'duration\n')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# How to create database-

In [33]:
db=sqlite3.connect('wonder_database.db')

In [34]:
cursor=db.cursor()

# What is DBMS-

A Database Management System (DBMS) is a software system that is designed to manage and organize data in a structured manner. It allows users to create, modify, and query a database, as well as manage the security and access controls for that database.

# some key features of a DBMS include:

Data modeling: A DBMS provides tools for creating and modifying data models, which define the structure and relationships of the data in a database.

Data storage and retrieval: A DBMS is responsible for storing and retrieving data from the database, and can provide various methods for searching and querying the data.

Concurrency control: A DBMS provides mechanisms for controlling concurrent access to the database, to ensure that multiple users can access the data without conflicting with each other.

Data integrity and security: A DBMS provides tools for enforcing data integrity and security constraints, such as constraints on the values of data and access controls that restrict who can access the data.

Backup and recovery: A DBMS provides mechanisms for backing up and recovering the data in the event of a system failure.

DBMS can be classified into two types: Relational Database Management System (RDBMS) and Non-Relational Database Management System (NoSQL or Non-SQL)

RDBMS: Data is organized in the form of tables and each table has a set of rows and columns. The data is related to each other through primary and foreign keys.

NoSQL: Data is organized in the form of key-value pairs, document, graph, or column-based. These are designed to handle large-scale, high-performance scenarios.

Database is a collection of interrelated data which helps in the efficient retrieval, insertion, and deletion of data from the database and organizes the data in the form of tables, views, schemas, reports, etc. For Example, a university database organizes the data about students, faculty, admin staff, etc. which helps in the efficient retrieval, insertion, and deletion of data from it.

# There are four types of Data Languages

Data Definition Language (DDL)
Data Manipulation Language(DML)
Data Control Language(DCL)
Transactional Control Language(TCL)

# DDL-
is the short name for Data Definition Language, which deals with database schemas and descriptions, of how the data should reside in the database.


CREATE: to create a database and its objects like (table, index, views, store procedure, function, and triggers)
ALTER: alters the structure of the existing database
DROP: delete objects from the database
TRUNCATE: remove all records from a table, including all spaces allocated for the records are removed
COMMENT: add comments to the data dictionary
RENAME: rename an object

# DML-
is the short name for Data Manipulation Language which deals with data manipulation and includes most common SQL statements such SELECT, INSERT, UPDATE, DELETE, etc., and it is used to store, modify, retrieve, delete and update data in a database.

SELECT: retrieve data from a database
INSERT: insert data into a table
UPDATE: updates existing data within a table
DELETE: Delete all records from a database table
MERGE: UPSERT operation (insert or update)
CALL: call a PL/SQL or Java subprogram
EXPLAIN PLAN: interpretation of the data access path
LOCK TABLE: concurrency Control

# DCL-
is short for Data Control Language which acts as an access specifier to the database.(basically to grant and revoke permissions to users in the database

GRANT: grant permissions to the user for running DML(SELECT, INSERT, DELETE,) commands on the table
REVOKE: revoke permissions to the user for running DML(SELECT, INSERT, DELETE,) command on the specified table

# The Problem of redundancy in Database-

Redundancy means having multiple copies of the same data in the database. This problem arises when a database is not normalized.

# Problems Caused Due to Redundancy-

Data Inconsistency: Redundancy can lead to data inconsistencies, where the same data is stored in multiple locations, and changes to one copy of the data are not reflected in the other copies. This can result in incorrect data being used in decision-making processes and can lead to errors and inconsistencies in the data. 

Storage Requirements: Redundancy increases the storage requirements of a database. If the same data is stored in multiple places, more storage space is required to store the data. This can lead to higher costs and slower data retrieval.
Update Anomalies: Redundancy can lead to update anomalies, where changes made to one copy of the data are not reflected in the other copies. This can result in incorrect data being used in decision-making processes and can lead to errors and inconsistencies in the data. 

Performance Issues: Redundancy can also lead to performance issues, as the database must spend more time updating multiple copies of the same data. This can lead to slower data retrieval and slower overall performance of the database.
Security Issues: Redundancy can also create security issues, as multiple copies of the same data can be accessed and manipulated by unauthorized users. This can lead to data breaches and compromise the confidentiality, integrity, and availability of the data.

Maintenance Complexity: Redundancy can increase the complexity of database maintenance, as multiple copies of the same data must be updated and synchronized. This can make it more difficult to troubleshoot and resolve issues and can require more time and resources to maintain the database.

Data Duplication: Redundancy can lead to data duplication, where the same data is stored in multiple locations, resulting in wasted storage space and increased maintenance complexity. This can also lead to confusion and errors, as different copies of the data may have different values or be out of sync.

Data Integrity: Redundancy can also compromise data integrity, as changes made to one copy of the data may not be reflected in the other copies. This can result in inconsistencies and errors and can make it difficult to ensure that the data is accurate and up-to-date.

Usability Issues: Redundancy can also create usability issues, as users may have difficulty accessing the correct version of the data or may be confused by inconsistencies and errors. This can lead to frustration and decreased productivity, as users spend more time searching for the correct data or correcting errors.

To prevent redundancy in a database, normalization techniques can be used. Normalization is the process of organizing data in a database to eliminate redundancy and improve data integrity. Normalization involves breaking down a larger table into smaller tables and establishing relationships between them. This reduces redundancy and makes the database more efficient and reliable.

In [76]:
result=cursor.execute("SELECT * from prateek")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
('roll no', 'name', 'age', 'course', 'fees', 'duration\n')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [79]:
result=cursor.execute("SELECT course,avg(fees) from prateek group by course")
for row in result:
    print(row)

('BE', 240000.0)
('IT', 202000.0)
('MBA', 163333.33333333334)
('ME', 245000.0)
('PG', 206666.66666666666)
('PHD', 185000.0)
('business analytics ', 130000.0)
('course', 0.0)
('data science', 50000.0)
('data science ', 155000.0)
('engineering', 216666.66666666666)

# How to get bottom last 5 records- Here just use the primary key

In [85]:
result=cursor.execute("SELECT * from prateek order by roll_no desc limit 5")
for row in result:
    print(row)

('roll no', 'name', 'age', 'course', 'fees', 'duration\n')
(130, 'kannu', '32', 'BE', 340000, 19)
(129, 'tannu ', '30', 'ME', 330000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(127, 'neha ', '28', 'engineering', 310000, 15)

In [86]:
result=cursor.execute("SELECT * from prateek order by roll_no asc limit 5")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)

In [15]:
result=cursor.execute("select name from pratik where name like '%m'")
for row in result:
    print(row)

('ram',)

In [16]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [36]:
result=cursor.execute('select course, count(course) as count from pratik  group by course having count>=3')
for row in result:
    print(row)

('BE', 3)
('IT', 5)
('MBA', 3)
('ME', 4)
('PG', 3)
('business analytics ', 3)
('data science ', 4)
('engineering', 3)

# What is the difference between the HAVING clause and the WHERE clause-


Answer: WHERE filters records before aggregating in GROUP BY, whereas HAVING filters after aggregation.     

How would you list the number of students enrolled in each course, but only display courses with more than 5 students?


SELECT course_id, COUNT(student_id) as number_of_students 
FROM enrollments 
GROUP BY course_id 
HAVING number_of_students > 5;

# To select distinct counts from a table-

In [34]:
result=cursor.execute('select count(distinct course) from pratik')
for row in result:
    print(row)

(10,)

# Exists Function-

Checks the result of the subquery

In [37]:
cursor.execute('CREATE TABLE prateek( roll_no int primary key,siblings int,last_name text,occupation text)')

In [48]:
with open(r"C:\Users\prate\Desktop\table.csv") as file:
    no_records=0
    for row in file:
        cursor.execute("INSERT INTO prateek VALUES(?,?,?,?)",row.split(","))
        db.commit()
    no_records+=1    
print(no_records,'Records inserted')

1 Records inserted

In [49]:
result=cursor.execute('select * from prateek')
for row in result:
    print(row)

('roll no', 'siblings', 'last name', 'Occupation\n')
(120, 1, 'sharma', 'engineer\n')
(121, 2, 'jain', 'engineer\n')
(122, 3, 'sharma', 'gk\n')
(123, 3, 'budha', 'gk\n')
(124, 1, 'agarwal', 'gk\n')
(125, 2, 'sharma', 'engineer\n')
(126, 3, 'sharma', 'engineer\n')
(127, 4, 'jain', 'engineer\n')
(128, 5, 'sharma', 'cbse\n')
(129, 1, 'budha', 'cbse\n')
(130, 2, 'agarwal', 'cbse\n')
(131, 3, 'sharma', 'cbse\n')
(132, 4, 'jain', 'cbse\n')
(133, 1, 'sharma', 'rbse\n')
(134, 2, 'budha', 'rbse\n')
(135, 3, 'agarwal', 'rbse\n')
(136, 4, 'sharma', 'rbse\n')
(137, 1, 'sharma', 'rbse\n')
(138, 2, 'jain', 'gk\n')
(139, 3, 'sharma', 'gk\n')
(140, 4, 'budha', 'gk\n')
('', '', '', '\n')

In [50]:
cursor.execute("delete from prateek where roll_no=='roll no' ")

In [51]:
result=cursor.execute('select * from prateek')
for row in result:
    print(row)

(120, 1, 'sharma', 'engineer\n')
(121, 2, 'jain', 'engineer\n')
(122, 3, 'sharma', 'gk\n')
(123, 3, 'budha', 'gk\n')
(124, 1, 'agarwal', 'gk\n')
(125, 2, 'sharma', 'engineer\n')
(126, 3, 'sharma', 'engineer\n')
(127, 4, 'jain', 'engineer\n')
(128, 5, 'sharma', 'cbse\n')
(129, 1, 'budha', 'cbse\n')
(130, 2, 'agarwal', 'cbse\n')
(131, 3, 'sharma', 'cbse\n')
(132, 4, 'jain', 'cbse\n')
(133, 1, 'sharma', 'rbse\n')
(134, 2, 'budha', 'rbse\n')
(135, 3, 'agarwal', 'rbse\n')
(136, 4, 'sharma', 'rbse\n')
(137, 1, 'sharma', 'rbse\n')
(138, 2, 'jain', 'gk\n')
(139, 3, 'sharma', 'gk\n')
(140, 4, 'budha', 'gk\n')
('', '', '', '\n')

In [52]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [56]:
result=cursor.execute('select * from pratik where exists(select 1 from prateek where pratik.roll_no==prateek.roll_no)')
for row in result:
    print(row)

(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [57]:
result=cursor.execute('select * from pratik where roll_no IN(select roll_no from prateek where pratik.roll_no==prateek.roll_no)')
for row in result:
    print(row)

(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [62]:
result=cursor.execute("select name || '' || age as prerna from pratik")
for row in result:
    print(row)

('pratik28',)
('Pratik 22',)
('ram21',)
('shyam 31',)
('sita31',)
('ayush 34',)
('mayank40',)
('raj 28',)
('ganesh 31',)
('kartik 28',)
('salman 33',)
('srk32',)
('ritik 27',)
('sheela38',)
('reena22',)
('mahima20',)
('ankita 33',)
('jyoti 35',)
('aayushi 21',)
('ranka 39',)
('aditi 23',)
('jainu30',)
('ritika26',)
('anushka35',)
('sheelu38',)
('radha24',)
('surbhi 28',)
('neha 28',)
('gabbu 40',)
('tannu 30',)
('kannu32',)

# How do you find the total number of rows in a table

In [65]:
result=cursor.execute("select count(*) from pratik")
for row in result:
    print(row)

(31,)

# How can you fetch the first 5 records from a table?

In [66]:
result=cursor.execute("select * from pratik limit 5")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)

In [79]:
cursor.execute('alter table pratik rename column name to Name ')

# How to make a copy of a table-

# Cloning of table-

There may be a number of occasions where you need to create an exact copy of an already defined (or created) table. MySQL enables you to perform this operation. Because we may need such duplicate tables for testing over the data without having any impact over the original table and the data stored in it.

In [83]:
cursor.execute('create table shiv(roll_no,siblings,last_name,occupation)')

In [84]:
cursor.execute('insert into shiv select * from prateek')

In [82]:
result=cursor.execute("select * from prateek")
for row in result:
    print(row)

(120, 1, 'sharma', 'engineer\n')
(121, 2, 'jain', 'engineer\n')
(122, 3, 'sharma', 'gk\n')
(123, 3, 'budha', 'gk\n')
(124, 1, 'agarwal', 'gk\n')
(125, 2, 'sharma', 'engineer\n')
(126, 3, 'sharma', 'engineer\n')
(127, 4, 'jain', 'engineer\n')
(128, 5, 'sharma', 'cbse\n')
(129, 1, 'budha', 'cbse\n')
(130, 2, 'agarwal', 'cbse\n')
(131, 3, 'sharma', 'cbse\n')
(132, 4, 'jain', 'cbse\n')
(133, 1, 'sharma', 'rbse\n')
(134, 2, 'budha', 'rbse\n')
(135, 3, 'agarwal', 'rbse\n')
(136, 4, 'sharma', 'rbse\n')
(137, 1, 'sharma', 'rbse\n')
(138, 2, 'jain', 'gk\n')
(139, 3, 'sharma', 'gk\n')
(140, 4, 'budha', 'gk\n')
('', '', '', '\n')

In [86]:
result=cursor.execute("select * from shiv")
for row in result:
    print(row)

(120, 1, 'sharma', 'engineer\n')
(121, 2, 'jain', 'engineer\n')
(122, 3, 'sharma', 'gk\n')
(123, 3, 'budha', 'gk\n')
(124, 1, 'agarwal', 'gk\n')
(125, 2, 'sharma', 'engineer\n')
(126, 3, 'sharma', 'engineer\n')
(127, 4, 'jain', 'engineer\n')
(128, 5, 'sharma', 'cbse\n')
(129, 1, 'budha', 'cbse\n')
(130, 2, 'agarwal', 'cbse\n')
(131, 3, 'sharma', 'cbse\n')
(132, 4, 'jain', 'cbse\n')
(133, 1, 'sharma', 'rbse\n')
(134, 2, 'budha', 'rbse\n')
(135, 3, 'agarwal', 'rbse\n')
(136, 4, 'sharma', 'rbse\n')
(137, 1, 'sharma', 'rbse\n')
(138, 2, 'jain', 'gk\n')
(139, 3, 'sharma', 'gk\n')
(140, 4, 'budha', 'gk\n')
('', '', '', '\n')

# If you want to change the primary key of a table-

In [95]:
cursor.execute('alter table pratik rename to prabhuu')

In [ ]:
cursor.execute('create table prateek(roll_no int,siblings primary key, last_name text,occupation text)')

That is how you can change the primary key of a table-

In [90]:
result=cursor.execute("select * from shiv")
for row in result:
    print(row)

(120, 1, 'sharma', 'engineer\n')
(121, 2, 'jain', 'engineer\n')
(122, 3, 'sharma', 'gk\n')
(123, 3, 'budha', 'gk\n')
(124, 1, 'agarwal', 'gk\n')
(125, 2, 'sharma', 'engineer\n')
(126, 3, 'sharma', 'engineer\n')
(127, 4, 'jain', 'engineer\n')
(128, 5, 'sharma', 'cbse\n')
(129, 1, 'budha', 'cbse\n')
(130, 2, 'agarwal', 'cbse\n')
(131, 3, 'sharma', 'cbse\n')
(132, 4, 'jain', 'cbse\n')
(133, 1, 'sharma', 'rbse\n')
(134, 2, 'budha', 'rbse\n')
(135, 3, 'agarwal', 'rbse\n')
(136, 4, 'sharma', 'rbse\n')
(137, 1, 'sharma', 'rbse\n')
(138, 2, 'jain', 'gk\n')
(139, 3, 'sharma', 'gk\n')
(140, 4, 'budha', 'gk\n')
('', '', '', '\n')

In [97]:
result=cursor.execute("select * from prabhuu")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# How to add forign key in existing table-

similarly as above you can change the foreign key of a table also.

# What is normalization, and why is it important-

Answer: Normalization is the process of organizing a database to reduce redundancy and ensure data integrity. It divides larger tables into smaller ones and establishes relationships between them using foreign keys.

# What is a subquery, and how is it different from a JOIN?
Answer: A subquery is a query nested inside another query. A subquery can return data that will be used in the main query as a condition. A JOIN is used to combine rows from two or more tables based on a related column.

# Write a query to find employees whose salary is above the average salary.

SELECT employee_name, salary 
FROM employees 
WHERE salary > (SELECT AVG(salary) FROM employees);

In [100]:
result=cursor.execute("select * from prabhuu")
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [103]:
result=cursor.execute("select name, fees from prabhuu where fees> (select avg(fees) from prabhuu) ")
for row in result:
    print(row)

('ankita ', 200000)
('jyoti ', 210000)
('aayushi ', 220000)
('ranka ', 230000)
('aditi ', 240000)
('jainu', 250000)
('ritika', 260000)
('anushka', 270000)
('sheelu', 280000)
('radha', 290000)
('surbhi ', 300000)
('neha ', 310000)
('gabbu ', 320000)
('tannu ', 330000)
('kannu', 340000)

# Length function-

In [107]:
result=cursor.execute("select length(name) from prabhuu")
for row in result:
    print(row)

(6,)
(7,)
(3,)
(6,)
(4,)
(6,)
(6,)
(4,)
(7,)
(7,)
(7,)
(3,)
(6,)
(6,)
(5,)
(6,)
(7,)
(6,)
(8,)
(6,)
(6,)
(5,)
(6,)
(7,)
(6,)
(5,)
(7,)
(5,)
(6,)
(6,)
(5,)

# Group concat function-

In [118]:
result=cursor.execute("select group_concat(name) from prabhuu")
for row in result:
    print(row)

('Pratik ,aayushi ,aditi ,ankita ,anushka,ayush ,gabbu ,ganesh ,jainu,jyoti ,kannu,kartik ,mahima,mayank,neha ,pratik,radha,raj ,ram,ranka ,reena,ritik ,ritika,salman ,sheela,sheelu,shyam ,sita,srk,surbhi ,tannu ',)

# Creating index to a column of a table-

In [116]:
result=cursor.execute("create index index_namee on shiv(roll_no)")

In [119]:
result=cursor.execute("select name from prabhuu")
for row in result:
    print(row)

('Pratik ',)
('aayushi ',)
('aditi ',)
('ankita ',)
('anushka',)
('ayush ',)
('gabbu ',)
('ganesh ',)
('jainu',)
('jyoti ',)
('kannu',)
('kartik ',)
('mahima',)
('mayank',)
('neha ',)
('pratik',)
('radha',)
('raj ',)
('ram',)
('ranka ',)
('reena',)
('ritik ',)
('ritika',)
('salman ',)
('sheela',)
('sheelu',)
('shyam ',)
('sita',)
('srk',)
('surbhi ',)
('tannu ',)

# Retrieve duplicates from the table-

In [127]:
result=cursor.execute("select course,count(course) from prabhuu group by course having count(course)>1")
for row in result:
    print(row)

('BE', 3)
('IT', 5)
('MBA', 3)
('ME', 4)
('PG', 3)
('PHD', 2)
('business analytics ', 3)
('data science ', 4)
('engineering', 3)

# Difference bw clustered index vs non clustered index-

1. Clustered inndex is the index defines the order at which data is stored in the table example dictionary B is its clustered index for B alphabets dictionary while non clustered index which are like book which is having index at the start. 

2. clustered index can only be one while non clustered index can be more than 1.

3. clustered index are faster than non clustered index.

# What is the difference between UNION and UNION ALL?
Answer: UNION returns unique records from the combined dataset, while UNION ALL returns all records, including duplicates.

# What is the difference between DATEDIFF and TIMESTAMPDIFF in MySQL?
Answer: Both are used to find the difference between two dates, but TIMESTAMPDIFF allows for a more specific interval, like month or year, while DATEDIFF returns the difference in days.

In [67]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [68]:
result=cursor.execute('select name,age,rank() over(order by age) as ranking from pratik')
for row in result:
    print(row)

('mahima', '20', 1)
('ram', '21', 2)
('aayushi ', '21', 2)
('Pratik ', '22', 4)
('reena', '22', 4)
('aditi ', '23', 6)
('radha', '24', 7)
('ritika', '26', 8)
('ritik ', '27', 9)
('pratik', '28', 10)
('raj ', '28', 10)
('kartik ', '28', 10)
('surbhi ', '28', 10)
('neha ', '28', 10)
('jainu', '30', 15)
('tannu ', '30', 15)
('shyam ', '31', 17)
('sita', '31', 17)
('ganesh ', '31', 17)
('srk', '32', 20)
('kannu', '32', 20)
('salman ', '33', 22)
('ankita ', '33', 22)
('ayush ', '34', 24)
('jyoti ', '35', 25)
('anushka', '35', 25)
('sheela', '38', 27)
('sheelu', '38', 27)
('ranka ', '39', 29)
('mayank', '40', 30)
('gabbu ', '40', 30)

# How do you remove duplicate rows in a table?
Answer: One common way is to create a new table with the distinct rows and delete the original table:
CREATE TABLE new_table AS SELECT DISTINCT * FROM original_table;
DROP TABLE original_table;
RENAME TABLE new_table TO original_table;

cursor.execute('insert into shiv select distinct* from pratik')

In [73]:
cursor.execute('CREATE TABLE GFGemployees(employee_id INT PRIMAR KEY, employee_name VARCHAR(50), manager_id INT)')

In [76]:
cursor.execute("INSERT INTO GFGemployees (employee_id, employee_name, manager_id)VALUES  (1, 'Zaid', 3),  (2, 'Rahul', 3),  (3, 'Raman', 4),  (4, 'Kamran', NULL),  (5, 'Farhan', 4)")

In [77]:
result=cursor.execute('select * from GFGemployees')
for row in result:
    print(row)

(1, 'Zaid', 3)
(2, 'Rahul', 3)
(3, 'Raman', 4)
(4, 'Kamran', None)
(5, 'Farhan', 4)

# How do you implement pagination in MySQL?
Answer: Using LIMIT and OFFSET.
SELECT * FROM table_name LIMIT 10 OFFSET 20;  -- Skips the first 20 records and fetches the next 10.

# Date column manipulation-

In [1]:
cursor.execute('CREATE TABLE StudentDetails (Student_Id INT AUTO_INCREMENT,First_name VARCHAR (100) NOT NULL,Last_name VARCHAR (100) NOT NULL,Date_Of_Birth DATE NOT NULL,Class VARCHAR (10) NOT NULL,Contact_Details BIGINT NOT NULL,PRIMARY KEY(Student_Id ))')

NameError: name 'cursor' is not defined

In [83]:
cursor.execute("INSERT INTO StudentDetails(First_name , Last_name , Date_Of_Birth , Class, Contact_Details) VALUES('Amit', 'Jana', '2004-12-22', 'XI', 1234567890), ('Manik', 'Aggarwal', '2006-07-04', 'IX', 1245678998),('Nitin', 'Das', '2005-03-14', 'X', 2245664909),('Priya', 'Pal', '2007-07-24', 'VIII', 3245642199),('Biswanath', 'Sharma', '2005-11-11', 'X', 2456789761),('Mani', 'Punia', '2006-01-20', 'IX', 3245675421),('Pritam', 'Patel', '2008-01-04', 'VII', 3453415421),('Sayak', 'Sharma', '2007-05-10', 'VIII' , 1214657890)")

In [84]:
result=cursor.execute('select * from StudentDetails')
for row in result:
    print(row)

(None, 'Amit', 'Jana', '2004-12-22', 'XI', 1234567890)
(None, 'Manik', 'Aggarwal', '2006-07-04', 'IX', 1245678998)
(None, 'Nitin', 'Das', '2005-03-14', 'X', 2245664909)
(None, 'Priya', 'Pal', '2007-07-24', 'VIII', 3245642199)
(None, 'Biswanath', 'Sharma', '2005-11-11', 'X', 2456789761)
(None, 'Mani', 'Punia', '2006-01-20', 'IX', 3245675421)
(None, 'Pritam', 'Patel', '2008-01-04', 'VII', 3453415421)
(None, 'Sayak', 'Sharma', '2007-05-10', 'VIII', 1214657890)

In [94]:
result=cursor.execute("select strftime('%m',Date_Of_Birth) from StudentDetails")
for row in result:
    print(row)

('12',)
('07',)
('03',)
('07',)
('11',)
('01',)
('01',)
('05',)

# Pivoting of table with filter method-

In [47]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

In [31]:
result=cursor.execute("select course,sum(fees) filter (where age==28),sum(fees) filter(where age==31) as 'two' from pratik group by course ")
for row in result:
    print(row)

('BE', None, None)
('IT', 110000, None)
('MBA', None, 70000)
('ME', None, None)
('PG', 300000, None)
('PHD', None, 80000)
('business analytics ', 130000, None)
('data science', 50000, None)
('data science ', None, 120000)
('engineering', 310000, None)

# Pivot table in SQLIT3-

In [ ]:
select
  product,
  sum(income) filter (where year = 2020) as "2020",
  sum(income) filter (where year = 2021) as "2021",
  sum(income) filter (where year = 2022) as "2022",
  sum(income) filter (where year = 2023) as "2023"
from sales
group by product
order by product;

In [38]:
result=cursor.execute("PRAGMA index_list('pratik')")
for row in result:
    print(row)

(0, 'xxx', 0, 'c', 0)
(1, 'xxxx', 0, 'c', 0)
(2, 'sqlite_autoindex_pratik_1', 1, 'pk', 0)

In [37]:
cursor.execute('create index xxx on pratik(roll_no,age)')

In [41]:
cursor.execute('drop index xxxx')

# When we want to select the no of text from a string-

In [67]:
result=cursor.execute('select substr(name,1,3) from pratik')
for row in result:
    print(row)

('pra',)
('Pra',)
('ram',)
('shy',)
('sit',)
('ayu',)
('may',)
('raj',)
('gan',)
('kar',)
('sal',)
('srk',)
('rit',)
('she',)
('ree',)
('mah',)
('ank',)
('jyo',)
('aay',)
('ran',)
('adi',)
('jai',)
('rit',)
('anu',)
('she',)
('rad',)
('sur',)
('neh',)
('gab',)
('tan',)
('kan',)

# Auto increment-

In [119]:
cursor.execute('CREATE TABLE S(Student_ID INTEGER PRIMARY KEY AUTOINCREMENT, First_Name varchar(255) NOT NULL,Last_Name varchar(255))')

In [107]:
cursor.execute("INSERT INTO St(Student_ID,First_Name, Last_Name ) VALUES (1,'Deeksha', 'Jain'),(2,'Kavisha', 'Parikh')")

In [108]:
result=cursor.execute('select * from st')
for row in result:
    print(row)

(1, 'Deeksha', 'Jain')
(2, 'Kavisha', 'Parikh')

In [109]:
cursor.execute("INSERT INTO St(First_Name, Last_Name ) VALUES ('Deeksha', 'Jain'),('Kavisha', 'Parikh')")

In [111]:
result=cursor.execute('select * from st')
for row in result:
    print(row)

(1, 'Deeksha', 'Jain')
(2, 'Kavisha', 'Parikh')
(3, 'Deeksha', 'Jain')
(4, 'Kavisha', 'Parikh')

# How to put condition on columns to not except null values-

In [120]:
cursor.execute('CREATE TABLE Ss(Student_ID INTEGER PRIMARY KEY AUTOINCREMENT, First_Name varchar(255) NOT NULL,Last_Name varchar(255))')

# Explain keyword-

In SQL, the EXPLAIN keyword provides a description of how the SQL queries are executed by the databases. These descriptions include the optimizer logs, how tables are joined and in what order, etc.

Hence, it would be a useful tool in query optimization and knowing the details of its execution step by step. The EXPLAIN also indicates the fact that a user who doesnt have any access to a particular database will not be provided details about how it executes the queries. So it maintains security as well.

The primary thing to note about EXPLAIN is that it will be used at the beginning of the query, i.e., before SELECT, INSERT, UPDATE, etc.

In [121]:
result=cursor.execute('explain select * from st')
for row in result:
    print(row)

(0, 'Init', 0, 9, 0, None, 0, None)
(1, 'OpenRead', 0, 15, 0, '3', 0, None)
(2, 'Rewind', 0, 8, 0, None, 0, None)
(3, 'Rowid', 0, 1, 0, None, 0, None)
(4, 'Column', 0, 1, 2, None, 0, None)
(5, 'Column', 0, 2, 3, None, 0, None)
(6, 'ResultRow', 1, 3, 0, None, 0, None)
(7, 'Next', 0, 3, 0, None, 1, None)
(8, 'Halt', 0, 0, 0, None, 0, None)
(9, 'Transaction', 0, 0, 12, '0', 1, None)
(10, 'Goto', 0, 1, 0, None, 0, None)

result=cursor.execute("explain select * from st where First_name=='Deeksha' ")
for row in result:
    print(row)

# What are the differences between VARCHAR and TEXT data types?

Answer: While both are used to store strings, VARCHAR can store up to 65,535 characters and you can specify its max length, while TEXT can store up to 65,535 characters without specifying max length. VARCHAR can have a default value, but TEXT cannot.

# A transaction-

Transactions group a set of tasks into a single execution unit. If one task fails, all fail. Useful for maintaining data integrity.

# Group concat function-

In [127]:
result=cursor.execute('select group_concat(name) from pratik')
for row in result:
    print(row)

('pratik,Pratik ,ram,shyam ,sita,ayush ,mayank,raj ,ganesh ,kartik ,salman ,srk,ritik ,sheela,reena,mahima,ankita ,jyoti ,aayushi ,ranka ,aditi ,jainu,ritika,anushka,sheelu,radha,surbhi ,neha ,gabbu ,tannu ,kannu',)

# Partition query-

In [129]:
result=cursor.execute('select course,sum(fees) over (partition by course) as total_amount,avg(age) over (partition by course) as avg_amount from pratik')
for row in result:
    print(row)

('BE', 720000, 26.666666666666668)
('BE', 720000, 26.666666666666668)
('BE', 720000, 26.666666666666668)
('IT', 1010000, 30.4)
('IT', 1010000, 30.4)
('IT', 1010000, 30.4)
('IT', 1010000, 30.4)
('IT', 1010000, 30.4)
('MBA', 490000, 34.0)
('MBA', 490000, 34.0)
('MBA', 490000, 34.0)
('ME', 980000, 34.5)
('ME', 980000, 34.5)
('ME', 980000, 34.5)
('ME', 980000, 34.5)
('PG', 620000, 33.666666666666664)
('PG', 620000, 33.666666666666664)
('PG', 620000, 33.666666666666664)
('PHD', 370000, 27.5)
('PHD', 370000, 27.5)
('business analytics ', 390000, 27.333333333333332)
('business analytics ', 390000, 27.333333333333332)
('business analytics ', 390000, 27.333333333333332)
('data science', 50000, 28.0)
('data science ', 620000, 24.75)
('data science ', 620000, 24.75)
('data science ', 620000, 24.75)
('data science ', 620000, 24.75)
('engineering', 650000, 30.333333333333332)
('engineering', 650000, 30.333333333333332)
('engineering', 650000, 30.333333333333332)

In [128]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# What's the difference between INNER JOIN and OUTER JOIN?

Answer: INNER JOIN returns rows when there's a match in both tables. OUTER JOIN returns all rows from one table and the matching rows from the other table, filling with NULL if no match is found.

# How can you retrieve a random row from a table-

In [142]:
result=cursor.execute('select * from pratik order by random() limit 1')
for row in result:
    print(row)

(102, 'ram', '21', 'business analytics ', 60000, 17)

# How can you update data in one table based on data in another table

In [ ]:
cursor.execute('CREATE TABLE demo_table11(ID int,NAME VARCHAR(20),AGE INT,CITY VARCHAR(20) )')

In [166]:
cursor.execute('CREATE TABLE demo_table21(ID int,NAME VARCHAR(20),AGE int)')

In [167]:
cursor.execute("INSERT INTO demo_table11 VALUES(1,'Romy',23,'Delhi'),(2,'Rahul',23,'Delhi'),(3,'Nikhil',24,'Punjab'),(4,'Ranvir',23,'Punjab'),(5,'Samiksha',23,'Banglore'),(6,'Ashtha',24,'Banglore'),(7,'Tannu',30,'Patna'),(8,'Girish',30,'Patna'),(9,'Ram', 20 , 'Patna'),(10,'Raj', 12, 'Delhi')")

In [168]:
cursor.execute("INSERT INTO demo_table21 VALUES(3,'Fanny',25 ),(7,'Prem', 30),(1,'Preeti',21),(4,'Samita',32)")

In [169]:
result=cursor.execute('select * from demo_table11')
for row in result:
    print(row)

(1, 'Romy', 23, 'Delhi')
(2, 'Rahul', 23, 'Delhi')
(3, 'Nikhil', 24, 'Punjab')
(4, 'Ranvir', 23, 'Punjab')
(5, 'Samiksha', 23, 'Banglore')
(6, 'Ashtha', 24, 'Banglore')
(7, 'Tannu', 30, 'Patna')
(8, 'Girish', 30, 'Patna')
(9, 'Ram', 20, 'Patna')
(10, 'Raj', 12, 'Delhi')

In [185]:
result=cursor.execute('select * from demo_table21')
for row in result:
    print(row)

(3, 'Fanny', 25)
(7, 'Prem', 30)
(1, 'Preeti', 21)
(4, 'Samita', 32)

In [171]:
cursor.execute("update demo_table11 set NAME=demo_table21.NAME, AGE=demo_table21.AGE from demo_table21 where demo_table11.ID=demo_table21.ID")

In [174]:
result=cursor.execute('select * from demo_table11')
for row in result:
    print(row)

(1, 'Preeti', 21, 'Delhi')
(2, 'Rahul', 23, 'Delhi')
(3, 'Fanny', 25, 'Punjab')
(4, 'Samita', 32, 'Punjab')
(5, 'Samiksha', 23, 'Banglore')
(6, 'Ashtha', 24, 'Banglore')
(7, 'Prem', 30, 'Patna')
(8, 'Girish', 30, 'Patna')
(9, 'Ram', 20, 'Patna')
(10, 'Raj', 12, 'Delhi')

# What are the different types of subqueries? Explain with examples.

Answer: There are three types:      
Scalar subquery: Returns a single value.     
SELECT column_name      
FROM table_name       
WHERE another_column = (SELECT MAX(column_name) FROM table_name);     
Row subquery: Returns a single row.


SELECT column1, column2     
FROM table_name      
WHERE (column1, column2) = (SELECT column1, column2 FROM another_table WHERE condition);    
Table subquery: Returns a table.     
  
SELECT column_name     
FROM (SELECT column_name FROM table_name WHERE condition) AS subquery_name;

In [188]:
result=cursor.execute("select NAME,AGE from demo_table21 where (ID,AGE)=(select ID,AGE from demo_table21 where ID==7 AND AGE==30)")
for row in result:
    print(row)

('Prem', 30)

In [195]:
result=cursor.execute('select NAME from (select NAME from demo_table11 where AGE>=25) as subquery')
for row in result:
    print(row)

('Fanny',)
('Samita',)
('Prem',)
('Girish',)

# What is a self-join and why would you use it?

Answer: A self-join is a join where a table is joined with itself. It's useful for finding relationships within the same table.

In [202]:
cursor.execute('CREATE TABLE emp_master(emp_id INTEGER PRIMARY KEY AUTOINCREMENT,first_name TEXT,last_name TEXT,salary NUMERIC,dept_id INTEGER,manager_id INTEGER)')

In [204]:
cursor.execute("INSERT INTO emp_master values (2,'Shweta','Jariwala', 19300,2,7),(3,'Vinay','Jariwala', 35100,3,2),(4,'Jagruti','Viras', 9500,2,7),(5,'Shweta','Rana',12000,3,2),(6,'sonal','Menpara', 13000,1,3),(7,'Yamini','Patel', 10000,2,7),(8,'Khyati','Shah', 49900,3,2),(9,'Shwets','Jariwala',19400,2,7)")

In [205]:
result=cursor.execute('select * from emp_master')
for row in result:
    print(row)

(2, 'Shweta', 'Jariwala', 19300, 2, 7)
(3, 'Vinay', 'Jariwala', 35100, 3, 2)
(4, 'Jagruti', 'Viras', 9500, 2, 7)
(5, 'Shweta', 'Rana', 12000, 3, 2)
(6, 'sonal', 'Menpara', 13000, 1, 3)
(7, 'Yamini', 'Patel', 10000, 2, 7)
(8, 'Khyati', 'Shah', 49900, 3, 2)
(9, 'Shwets', 'Jariwala', 19400, 2, 7)

In [226]:
cursor.execute('select x.emp_id,x.first_name,y.emp_id,y.first_name from emp_master x,emp_master y where x.manager_id=y.emp_id')
for row in result:
    print(row)

(2, 'Shweta', 7, 'Yamini')
(3, 'Vinay', 2, 'Shweta')
(4, 'Jagruti', 7, 'Yamini')
(5, 'Shweta', 2, 'Shweta')
(6, 'sonal', 3, 'Vinay')
(7, 'Yamini', 7, 'Yamini')
(8, 'Khyati', 2, 'Shweta')
(9, 'Shwets', 7, 'Yamini')

# How to get the list of tables from the whole database-

In [241]:
result=cursor.execute("SELECT name FROM sqlite_schema WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' ORDER BY 1")
for row in result:
    print(row)

('S',)
('Ss',)
('St',)
('Stu',)
('Stud',)
('Stude',)
('Studen',)
('Student',)
('Students',)
('demo_table1',)
('demo_table11',)
('demo_table2',)
('demo_table21',)
('emp_master',)
('pratik',)
('teen',)
('teenu',)

In [242]:
result=cursor.execute("SELECT name FROM sqlite_schema WHERE type IN ('table','view') ")
for row in result:
    print(row)

('pratik',)
('Students',)
('Student',)
('Studen',)
('Stude',)
('Stud',)
('sqlite_sequence',)
('Stu',)
('St',)
('S',)
('Ss',)
('teenu',)
('teen',)
('demo_table1',)
('demo_table2',)
('demo_table11',)
('demo_table21',)
('emp_master',)

# Schema-

it is a logical representation of data.it is a container having tables.

information_schema is a meta-database that provides detailed information about all other databases, tables, columns, indexes, constraints, etc.

# How can you delete all records from a table without deleting the table?

TRUNCATE TABLE table_name;

# We can use this command to delete everything from the table-

In [244]:
cursor.execute('delete from s')

# Rename column name in table-

In [266]:
result=cursor.execute('select * from demo_table11')
for row in result:
    print(row)

(1, 'Preeti', 21, 'Delhi')
(2, 'Rahul', 23, 'Delhi')
(3, 'Fanny', 25, 'Punjab')
(4, 'Samita', 32, 'Punjab')
(5, 'Samiksha', 23, 'Banglore')
(6, 'Ashtha', 24, 'Banglore')
(7, 'Prem', 30, 'Patna')
(8, 'Girish', 30, 'Patna')
(9, 'Ram', 20, 'Patna')
(10, 'Raj', 12, 'Delhi')

In [247]:
cursor.execute('alter table demo_table11 rename column "NAME" to cheeku')

# How to get table informations-

In [21]:
result=cursor.execute('PRAGMA table_info(pratik)')
for row in result:
    print(row)

(0, 'roll_no', 'INT', 0, None, 1)
(1, 'name', 'TEXT', 0, None, 0)
(2, 'age', 'TEXT', 0, None, 0)
(3, 'course', 'TEXT', 0, None, 0)
(4, 'fees', 'INT', 0, None, 0)
(5, 'duration', 'INT', 0, None, 0)

# What is a correlated subquery?

Answer: A correlated subquery is a subquery that references columns from the outer query. It's executed once for each row processed by the outer query.
SELECT column_name 
FROM table_name t1
WHERE some_value = (SELECT MAX(column_name) FROM table_name t2 WHERE t1.id = t2.id);

# How to know how many rows affected by the query-

In [46]:
result=cursor.execute('select * from pratik where fees==50000')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)

In [45]:
result=cursor.execute('select count(*) from pratik where fees==50000')
for row in result:
    print(row)

(2,)

In [69]:
result=cursor.execute('select * from pratik')
for row in result:
    print(row)

(100, 'pratik', '28', 'data science', 50000, '1 year')
(101, 'Pratik ', '22', 'data science ', 50000, 16)
(102, 'ram', '21', 'business analytics ', 60000, 17)
(103, 'shyam ', '31', 'MBA', 70000, 20)
(104, 'sita', '31', 'PHD', 80000, 18)
(105, 'ayush ', '34', 'PG', 90000, 14)
(106, 'mayank', '40', 'engineering', 100000, 19)
(107, 'raj ', '28', 'IT', 110000, 14)
(108, 'ganesh ', '31', 'data science ', 120000, 14)
(109, 'kartik ', '28', 'business analytics ', 130000, 11)
(110, 'salman ', '33', 'MBA', 140000, 13)
(111, 'srk', '32', 'IT', 150000, 16)
(112, 'ritik ', '27', 'BE', 160000, 15)
(113, 'sheela', '38', 'ME', 170000, 13)
(114, 'reena', '22', 'IT', 180000, 18)
(115, 'mahima', '20', 'data science ', 190000, 15)
(116, 'ankita ', '33', 'business analytics ', 200000, 18)
(117, 'jyoti ', '35', 'ME', 210000, 18)
(118, 'aayushi ', '21', 'BE', 220000, 19)
(119, 'ranka ', '39', 'PG', 230000, 17)
(120, 'aditi ', '23', 'engineering', 240000, 15)
(121, 'jainu', '30', 'IT', 250000, 11)
(122, 'ritika', '26', 'data science ', 260000, 10)
(123, 'anushka', '35', 'ME', 270000, 10)
(124, 'sheelu', '38', 'MBA', 280000, 12)
(125, 'radha', '24', 'PHD', 290000, 10)
(126, 'surbhi ', '28', 'PG', 300000, 19)
(127, 'neha ', '28', 'engineering', 310000, 15)
(128, 'gabbu ', '40', 'IT', 320000, 10)
(129, 'tannu ', '30', 'ME', 330000, 15)
(130, 'kannu', '32', 'BE', 340000, 19)

# Getting query in the form of data frame-

In [70]:
column_names = [i[0] for i in cursor.description]

In [71]:
column_names

['roll_no', 'name', 'age', 'course', 'fees', 'duration']

In [73]:
import pandas as pd

In [76]:
cursor.execute('select * from pratik')

In [77]:
pd.DataFrame.from_records(cursor, columns=[i[0] for i in cursor.description])

    roll_no      name age               course    fees duration
0       100    pratik  28         data science   50000   1 year
1       101   Pratik   22        data science    50000       16
2       102       ram  21  business analytics    60000       17
3       103    shyam   31                  MBA   70000       20
4       104      sita  31                  PHD   80000       18
5       105    ayush   34                   PG   90000       14
6       106    mayank  40          engineering  100000       19
7       107      raj   28                   IT  110000       14
8       108   ganesh   31        data science   120000       14
9       109   kartik   28  business analytics   130000       11
10      110   salman   33                  MBA  140000       13
11      111       srk  32                   IT  150000       16
12      112    ritik   27                   BE  160000       15
13      113    sheela  38                   ME  170000       13
14      114     reena  22                   IT  180000       18
15      115    mahima  20        data science   190000       15
16      116   ankita   33  business analytics   200000       18
17      117    jyoti   35                   ME  210000       18
18      118  aayushi   21                   BE  220000       19
19      119    ranka   39                   PG  230000       17
20      120    aditi   23          engineering  240000       15
21      121     jainu  30                   IT  250000       11
22      122    ritika  26        data science   260000       10
23      123   anushka  35                   ME  270000       10
24      124    sheelu  38                  MBA  280000       12
25      125     radha  24                  PHD  290000       10
26      126   surbhi   28                   PG  300000       19
27      127     neha   28          engineering  310000       15
28      128    gabbu   40                   IT  320000       10
29      129    tannu   30                   ME  330000       15
30      130     kannu  32                   BE  340000       19

In [84]:
cursor.execute('select course,fees,count(*) as count from pratik group by course')
pd.DataFrame.from_records(cursor, columns=[i[0] for i in cursor.description])

                course    fees  count
0                   BE  160000      3
1                   IT  110000      5
2                  MBA   70000      3
3                   ME  170000      4
4                   PG   90000      3
5                  PHD   80000      2
6  business analytics    60000      3
7         data science   50000      1
8        data science    50000      4
9          engineering  100000      3

In [85]:
cursor.execute('select course,fees,count(*) as count from pratik group by course having count>1')
pd.DataFrame.from_records(cursor, columns=[i[0] for i in cursor.description])

                course    fees  count
0                   BE  160000      3
1                   IT  110000      5
2                  MBA   70000      3
3                   ME  170000      4
4                   PG   90000      3
5                  PHD   80000      2
6  business analytics    60000      3
7        data science    50000      4
8          engineering  100000      3

In [86]:
 cursor.description

(('course', None, None, None, None, None, None),
 ('fees', None, None, None, None, None, None),
 ('count', None, None, None, None, None, None))

# How to number the duplicates-

In [93]:
cursor.execute('select course,row_number() over (partition by course) as rn from pratik ')
pd.DataFrame.from_records(cursor, columns=[i[0] for i in cursor.description])

                 course  rn
0                    BE   1
1                    BE   2
2                    BE   3
3                    IT   1
4                    IT   2
5                    IT   3
6                    IT   4
7                    IT   5
8                   MBA   1
9                   MBA   2
10                  MBA   3
11                   ME   1
12                   ME   2
13                   ME   3
14                   ME   4
15                   PG   1
16                   PG   2
17                   PG   3
18                  PHD   1
19                  PHD   2
20  business analytics    1
21  business analytics    2
22  business analytics    3
23         data science   1
24        data science    1
25        data science    2
26        data science    3
27        data science    4
28          engineering   1
29          engineering   2
30          engineering   3

In [97]:
result=cursor.execute('select changes()')
for row in result:
    print(row)

(1,)

# Absolute function-

In [98]:
result=cursor.execute('select abs(fees) from pratik')
for row in result:
    print(row)

(50000,)
(50000,)
(60000,)
(70000,)
(80000,)
(90000,)
(100000,)
(110000,)
(120000,)
(130000,)
(140000,)
(150000,)
(160000,)
(170000,)
(180000,)
(190000,)
(200000,)
(210000,)
(220000,)
(230000,)
(240000,)
(250000,)
(260000,)
(270000,)
(280000,)
(290000,)
(300000,)
(310000,)
(320000,)
(330000,)
(340000,)

# Create table if not exist-

In [11]:
cursor.execute('create table if not exists pr(c int primary key,v int,d int generated always as (c*v) )')

In [13]:
cursor.execute('insert into pr values(1,2),(2,3)')

In [14]:
result=cursor.execute('select * from pr')
for row in result:
    print(row)

(1, 2, 2)
(2, 3, 6)

# Time function-

In [130]:
result=cursor.execute("SELECT TIME('22:50:10', '+1 minute')")
for row in result:
    print(row)

('22:51:10',)

In [133]:
result=cursor.execute("SELECT DATETIME('2050-08-21 23:30:45', '+47 minutes')")
for row in result:
    print(row)

('2050-08-22 00:17:45',)

In [54]:
result=cursor.execute('SELECT sql FROM sqlite_schema ORDER BY tbl_name, type DESC, name')
for row in result:
    print(row)

('CREATE TABLE pratik(roll_no int PRIMARY KEY,name text,age text,course text,fees int,duration int)',)
(None,)

# How to convert sql result to data frame-

In [35]:
cursor.execute('select * from pratik')

In [36]:
cursor.description

(('roll_no', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('age', None, None, None, None, None, None),
 ('course', None, None, None, None, None, None),
 ('fees', None, None, None, None, None, None),
 ('duration', None, None, None, None, None, None))

In [37]:
import pandas as pd

In [38]:
pd.DataFrame.from_records(cursor, columns=[i[0] for i in cursor.description])

    roll_no      name age               course    fees duration
0       100    pratik  28         data science   50000   1 year
1       101   Pratik   22        data science    50000       16
2       102       ram  21  business analytics    60000       17
3       103    shyam   31                  MBA   70000       20
4       104      sita  31                  PHD   80000       18
5       105    ayush   34                   PG   90000       14
6       106    mayank  40          engineering  100000       19
7       107      raj   28                   IT  110000       14
8       108   ganesh   31        data science   120000       14
9       109   kartik   28  business analytics   130000       11
10      110   salman   33                  MBA  140000       13
11      111       srk  32                   IT  150000       16
12      112    ritik   27                   BE  160000       15
13      113    sheela  38                   ME  170000       13
14      114     reena  22                   IT  180000       18
15      115    mahima  20        data science   190000       15
16      116   ankita   33  business analytics   200000       18
17      117    jyoti   35                   ME  210000       18
18      118  aayushi   21                   BE  220000       19
19      119    ranka   39                   PG  230000       17
20      120    aditi   23          engineering  240000       15
21      121     jainu  30                   IT  250000       11
22      122    ritika  26        data science   260000       10
23      123   anushka  35                   ME  270000       10
24      124    sheelu  38                  MBA  280000       12
25      125     radha  24                  PHD  290000       10
26      126   surbhi   28                   PG  300000       19
27      127     neha   28          engineering  310000       15
28      128    gabbu   40                   IT  320000       10
29      129    tannu   30                   ME  330000       15
30      130     kannu  32                   BE  340000       19

# Important questions-

1 Explain Order of Execution of SQL query     
2 Provide a use case for each of the functions Rank, Dense_Rank & Row_Number (  majority struggle )      
3 Write a query to find the cumulative sum/Running Total      
4 Find the Most selling product by sales/ highest Salary of employees     
5 Write a query to find the 2nd/nth highest Salary of employees     
6 Difference between union vs union all    
7 Identify if there any duplicates in a table     
8 Scenario based Joins question, understanding of Inner, Left and Outer Joins via simple yet tricky question    
9 LAG, write a query to find all those records where the transaction value is greater then previous transaction value     
1 0 Rank vs Dense Rank, query to find the 2nd highest Salary of employee     
( Ideal soln should handle ties)     
1 1 Write a query to find the Running Difference (Ideal sol'n using windows function)     
1 2 Write a query to display year on year/month on month growth    
1 3 Write a query to find rolling average of daily sign-ups     
1 4 Write a query to find the running difference using self join (helps in understanding the logical approach, ideally this question is solved via windows function)    
1 5 Write a query to find the cumulative sum using self join     
(helps in understanding the logical approach, ideally this question is solved via windows function)

# Order of Execution
The order of execution of an SQL querys clauses is as follows:

First, the table on which the DML operation is performed has to be processed. So, the FROM clause is evaluated first in an SQL Query. If the query contains JOIN clauses, tables are combined by merging rows involved, before FROM clause. So, JOIN predates FROM in statements with JOIN. Now table data is acquired before any filter or group is done. So subsequent clauses can be evaluated based on this data which is much smaller than the original tables before JOIN operations. This also processes the subqueries.
SQL may create a temporary table internally to evaluate this. To make code memory efficient, it is good to have simpler table JOINs it would be highly memory intensive.
WHERE: After the table data on which other operations take place is processed by JOIN and FROM clause, WHERE clause is evaluated. WHERE clause filters the rows based on conditions from the table evaluated by the FROM clause. This WHERE clause discards rows that dont satisfy the conditions, thus reducing the rows of data that need to be processed further in other clauses.
GROUP BY: If the query has a GROUP BY clause, it is executed next. Here, the data is grouped based on the common value in the column specified in the GROUP BY clause. This reduces the number of rows further equal to no of distinct values in the GROUP BY column. This helps to calculate aggregate functions.
HAVING: If the query had a GROUP BY clause, the HAVING clause is evaluated immediately after GROUP BY. HAVING clause is not compulsory for GROUP BY. Similar to WHERE operations, this clause also filters the table group processed before by the GROUP BY clause. This HAVING also discards rows that dont satisfy the conditions, thus reducing the rows of data that need to be processed further in other clauses
SELECT: The SELECT is executed next after GROUP BY and HAVING. It computes expressions (arithmetic, aggregate, etc.) and aliases given in the SELECT clause. The computation is now performed on the smallest dataset after much filtering and grouping operations done by previous clauses.
DISTINCT: The DISTINCT clause is executed after evaluating expressions, and alias references in the previous step. It filters any duplicate rows and returns only unique rows.
ORDER BY: After executing all the above clauses, the data to be displayed or processed is computed. Now ORDER BY is executed to sort it based on particular column(s) either in ascending or descending order. It is left associative, that is it is sorted based on the first specified column and then by the second, and so on.
LIMIT/OFFSET: At last, after the order of data to be processed is evaluated, LIMIT and OFFSET clauses are evaluated to display only the rows that fall within the LIMIT. So, it is generally not recommended to LIMIT only certain rows from many rows evaluated before, since It is not efficient and waste of computation.

janta fir wahi gand hilayegi select distinct oblized loda.(join-from-where-groupby-having-select-distinct-orderby-limit/offset)

# Row no vs Rank vs Dense Rank-

In [9]:
cursor.execute('CREATE TABLE StudentScore(Student_ID INT PRIMARY KEY,Student_Name NVARCHAR (50),Student_Score INT)')

In [12]:
cursor.execute("INSERT INTO StudentScore VALUES (1,'Ali', 978),(2,'Zaid', 770),(3,'Mohd', 1140),(4,'Jack', 770),(5,'John', 1240),(6,'Mike', 1140),(7,'Goerge', 885)")

In [15]:
result=cursor.execute("SELECT * FROM StudentScore ORDER BY Student_Score")
for row in result:
    print(row)

(2, 'Zaid', 770)
(4, 'Jack', 770)
(7, 'Goerge', 885)
(1, 'Ali', 978)
(3, 'Mohd', 1140)
(6, 'Mike', 1140)
(5, 'John', 1240)

# ROW_NUMBER()

In [20]:
result=cursor.execute("SELECT *, ROW_NUMBER() OVER(ORDER BY Student_Score) AS RowNumberRank FROM StudentScore")
for row in result:
    print(row)

(2, 'Zaid', 770, 1)
(4, 'Jack', 770, 2)
(7, 'Goerge', 885, 3)
(1, 'Ali', 978, 4)
(3, 'Mohd', 1140, 5)
(6, 'Mike', 1140, 6)
(5, 'John', 1240, 7)

# Partition by- 

A PARTITION BY clause is used to partition rows of table into groups. It is useful when we have to perform a calculation on individual rows of a group using other rows of that group.

It is always used inside OVER() clause.

In [18]:
result=cursor.execute("SELECT *, ROW_NUMBER() OVER(PARTITION BY Student_Score  ORDER BY Student_Score) AS RowNumberRank FROM StudentScore")
for row in result:
    print(row)

(2, 'Zaid', 770, 1)
(4, 'Jack', 770, 2)
(7, 'Goerge', 885, 1)
(1, 'Ali', 978, 1)
(3, 'Mohd', 1140, 1)
(6, 'Mike', 1140, 2)
(5, 'John', 1240, 1)

# Rank-

The RANK() ranking window function returns a unique rank number for each distinct row within the partition according to a specified column value, starting at 1 for the first row in each partition, with the same rank for duplicate values and leaving gaps between the ranks; this gap appears in the sequence after the duplicate values. In other words, the RANK() ranking window function behaves like the ROW_NUMBER() function except for the rows with equal values, where it will rank with the same rank ID and generate a gap after it. If we modify the previous ranking query to use the RANK() ranking function:

In [21]:
result=cursor.execute("SELECT *,  RANK ()  OVER( ORDER BY Student_Score) AS RankRank FROM StudentScore")
for row in result:
    print(row)

(2, 'Zaid', 770, 1)
(4, 'Jack', 770, 1)
(7, 'Goerge', 885, 3)
(1, 'Ali', 978, 4)
(3, 'Mohd', 1140, 5)
(6, 'Mike', 1140, 5)
(5, 'John', 1240, 7)

# DENSE_RANK()

The DENSE_RANK() ranking window function is similar to the RANK() function by generating a unique rank number for each distinct row within the partition according to a specified column value, starting at 1 for the first row in each partition, ranking the rows with equal values with the same rank number, except that it does not skip any rank, leaving no gaps between the ranks.

In [22]:
result=cursor.execute("SELECT *,  DENSE_RANK() OVER( ORDER BY Student_Score) AS RankRank FROM StudentScore")
for row in result:
    print(row)

(2, 'Zaid', 770, 1)
(4, 'Jack', 770, 1)
(7, 'Goerge', 885, 2)
(1, 'Ali', 978, 3)
(3, 'Mohd', 1140, 4)
(6, 'Mike', 1140, 4)
(5, 'John', 1240, 5)

# Running total-

In [27]:
cursor.execute("CREATE TABLE department(ID int primary key,SALARY int,NAME text ,DEPT_ID int)")

In [30]:
cursor.execute("INSERT INTO department values (1, 34000, 'ANURAG', 'UI DEVELOPERS'),(2, 33000, 'harsh', 'BACKEND DEVELOPERS'),(3, 36000, 'SUMIT', 'BACKEND DEVELOPERS'),(4, 36000, 'RUHI', 'UI DEVELOPERS'),(5, 37000, 'KAE', 'UI DEVELOPERS')")

In [31]:
result=cursor.execute('SELECT * FROM department')
for row in result:
    print(row)

(1, 34000, 'ANURAG', 'UI DEVELOPERS')
(2, 33000, 'harsh', 'BACKEND DEVELOPERS')
(3, 36000, 'SUMIT', 'BACKEND DEVELOPERS')
(4, 36000, 'RUHI', 'UI DEVELOPERS')
(5, 37000, 'KAE', 'UI DEVELOPERS')

In [37]:
result=cursor.execute("SELECT * ,SUM(SALARY) OVER (ORDER BY ID) FROM department")
for row in result:
    print(row)

(1, 34000, 'ANURAG', 'UI DEVELOPERS', 34000)
(2, 33000, 'harsh', 'BACKEND DEVELOPERS', 67000)
(3, 36000, 'SUMIT', 'BACKEND DEVELOPERS', 103000)
(4, 36000, 'RUHI', 'UI DEVELOPERS', 139000)
(5, 37000, 'KAE', 'UI DEVELOPERS', 176000)

# Second highest salary

In [38]:
result=cursor.execute('SELECT * FROM department')
for row in result:
    print(row)

(1, 34000, 'ANURAG', 'UI DEVELOPERS')
(2, 33000, 'harsh', 'BACKEND DEVELOPERS')
(3, 36000, 'SUMIT', 'BACKEND DEVELOPERS')
(4, 36000, 'RUHI', 'UI DEVELOPERS')
(5, 37000, 'KAE', 'UI DEVELOPERS')

In [39]:
result=cursor.execute('SELECT max(salary) FROM department where salary<(select max(salary) from department)')
for row in result:
    print(row)

(36000,)

# Highest salary-

In [42]:
result=cursor.execute('SELECT max(salary) FROM department')
for row in result:
    print(row)

(37000,)

# Third highest from a table with limit-

In [54]:
result=cursor.execute('SELECT salary FROM department order by salary desc limit 1 offset 3')
for row in result:
    print(row)

(34000,)

# Third highest from a table without limit-

In [62]:
result=cursor.execute('SELECT *,dense_rank() over(order by salary) as rank FROM department')
for row in result:
    print(row)

(2, 33000, 'harsh', 'BACKEND DEVELOPERS', 1)
(1, 34000, 'ANURAG', 'UI DEVELOPERS', 2)
(3, 36000, 'SUMIT', 'BACKEND DEVELOPERS', 3)
(4, 36000, 'RUHI', 'UI DEVELOPERS', 3)
(5, 37000, 'KAE', 'UI DEVELOPERS', 4)

# Identify duplicates in table-

In [71]:
result=cursor.execute('SELECT *,count(salary) from department group by salary having count(salary)>1 ')
for row in result:
    print(row)

(3, 36000, 'SUMIT', 'BACKEND DEVELOPERS', 2)

# Different types of keys which we used in Relation Models.
================================

1. Super Key : Super Key is a subset of all the key.
It can have single attribute or combined other attributes together.
Any permutations and combinations in table can be Super Key.


2. Primary Key.
It is a unique identifier which helps to identify each and every record uniquely.

Each table have only one primary key and it cannot have null value.

3.Candidate key.
It is a minimum set of attribute which uniquely identifies each record.


4. Alternate key.
All the Candidate key except Primary is an Alternate key.

5. Foreign key.
It creates the parent child relationship between two tables.

6. Composite key.
Primary key which is formed using atleast two attributes.

7. Compound Key.
Primary key which is formed using two foreign key which is referenced in some other relation.

8. Surrogate Key.
Uniquely identify the data, Generally we Give Surrogate key as integers.

# One of the most important questions that can be asked in sql interviews :
Difference between delete,drop and truncate:
1) delete:
delete is a DML command used to delete certain rows from a table and is used with a where clause.
For example:
delete from tablename where id=101;
Important thing to remember here is if delete is not accompanied with where clause and you simply write :
delete from tablename;
then it can lead to deletion of all the table entries.
2) drop:
drop is used to either delete a table or entire database completely from your system:
For example:
drop table tablename;
If we perform this operation then the table or database cannot be rollback.
3) truncate:
Truncate is used to delete the entire table rows and it is faster as compared to delete,truncate can lead to deleting all the rows from table but it keeps the table structure.
For example:
truncate table tablename;

# Data Integrity Example:
If there is one customer in one profile, then there will be only one unique customer profile. For example - customer id, customer name, customer phone number, customer address. In that case, You can't add two or more customers with the same id because it can show duplicate values and violate data integration rules.

# What are Constraints?
Ans- Constraints in SQL are used to specify the limit on the data type        
of the table. It can be specified while creaPng or altering the table        
statement. The sample of constraints are:       
 NOT NULL       
 CHECK        
 DEFAULT      
 UNIQUE       
 PRIMARY KEY       
 FOREIGN KEY

# What do you mean by table and field in SQL?
A table refers to a collecPon of data in an organised manner in form        
of rows and columns. A field refers to the number of columns in a      
table. For example:      
Table: StudentInformaPon     
Field: Stu Id, Stu Name, Stu Mark

# Need for Database Testing
We need to perform database testing to ensure that the data in our database is accurate and up to date. 


Database testing can help identify any potential issues with the database itself, such as performance issues or security vulnerabilities. 
By performing regular database testing, we can help ensure that our database is running smoothly and efficiently. 
We need to perform database testing to ensure that the database is functioning correctly. 
This includes testing the data integrity and consistency, testing the performance of the database, and testing the security of the database. 
Database testing is important because it helps to find errors and potential problems with the database before the application goes live. 
This can save a lot of time and money in the long run. Database testing is also important because it can help to improve the quality of the application. 
By finding and fixing errors in the database, the application will be more stable and reliable.
Types of Database Testing
Below are the different types of database testing:

1. Functional Database Testing
Functional database testing is a process of verifying the functionality of the database by testing the data that is stored in it. This type of testing can be used to test the functionality of a database system as a whole or to test the functionality of individual components within the system. Functional testing can be performed using either white-box or black-box techniques.

# White box testing: 
It is a process of testing the database by looking at the internal structure of the database. This type of testing is also known as clear box testing or structural testing. White box testing can be used to verify the correctness of the data, integrity of the data, and consistency of the data. White-box testing is a type of testing that uses knowledge of the internal structure of the system under test to design test cases. 
# Black box testing:
It is a process of testing the database without looking at the internal structure of the database. This type of testing is also known as behavioral testing. Black box testing can be used to verify the functionality of the database. Black-box testing is a type of testing that does not use any knowledge of the internal structure of the system under test. This type of testing is often used to assess the functionality of a system as a whole.

# A stored procedure-

is a piece of prepared SQL code that you can save 
and reuse again and over.
So, if you have a SQL query that you create frequently, save it as a 
stored procedure and then call it to run it.
You may also supply parameters to a stored procedure so that it can 
act based on the value(s) of the parameter(s) given

CREATE PROCEDURE select_all_data
AS
SELECT * FROM gfgTutorial
GO;

# What is BLOB and TEXT in MySQL?
Ans- BLOB stands for Binary Huge Objects and can be used to store 
binary data, whereas TEXT may be used to store a large number of 
strings. BLOB may be used to store binary data, which includes 
images, movies, audio, and applicaPons.
BLOB values funcPon similarly to byte strings, and they lack a 
character set. As a result, bytes numeric values are completely 
dependent on comparison and sorPng.
 TEXT values behave similarly to a character string or a non-binary 
string. The comparison/sorPng of TEXT is completely dependent on 
the character set collecPon.

# What is Schema?
The Skeleton of the database is created by the attributes and this skeleton is named Schema.
Schema mentions the logical constraints like table, primary key, etc.
The schema does not represent the data type of the attributes.
Details of a Customer
Details of a Customer

Schema of Customer
                                            Schema of Customer 

Database Schema
A database schema is a logical representation of data that shows how the data in a database should be stored logically. It shows how the data is organized and the relationship between the tables.
Database schema contains table, field, views and relation between different keys like primary key, foreign key.
Data are stored in the form of files which is unstructured in nature which makes accessing the data difficult. Thus to resolve the issue the data are organized in structured way with the help of database schema.
Database schema provides the organization of data and the relationship between the stored data.
Database schema defines a set of guidelines that control the database along with that it provides information about the way of accessing and modifying the data.